{"2017-01-01": {"bonus": "Archmonsters will appear 200% more quickly than usual.", "id": "105205", "quest": "4 Golden Dreggon Egg"}, "2017-01-02": {"bonus": "Farmers save 10% of their ingredients when they craft items.", "id": "34154", "quest": "20 Oats"}, "2017-01-03": {"bonus": "Experience gained by fighting Otomai's Ark monsters is increased by 75%.", "id": "15014", "quest": "2 Sparo's Scarf"}, "2017-01-04": {"bonus": "The chances of obtaining loot from Fangs of Glass monsters are increased by 75%.", "id": "65759", "quest": "2 Gluttonous Brockhard Tail"}, "2017-01-05": {"bonus": "The quantity of Yew Wood and Bamboo Wood harvested by lumberjacks is increased by 150%.", "id": "38094", "quest": "12 Yew Wood"}, "2017-01-06": {"bonus": "A special repeatable quest is available today near the Bakers' Workshop in Amakna Village .", "id": "54197", "quest": "2 Wo Wabbit Hair"}, "2017-01-07": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Forest animals .", "id": "15058", "quest": "7 Boar Snout"}, "2017-01-08": {"bonus": "Experience gained in the Sand Dungeon is increased by 125%.", "id": "55130", "quest": "2 Beach Towel"}, "2017-01-09": {"bonus": "The quality of items crafted in the city of Bonta is increased.", "id": "6001", "quest": "2 Holy Sword"}, "2017-01-10": {"bonus": "All varieties of Emerald Dragoturkey will give birth to one extra baby.", "id": "104594", "quest": "2 Golden Dragoturkey Wing"}, "2017-01-11": {"bonus": "The chances of obtaining loot in the Dopple Training area are increased by 100%.", "id": "15092", "quest": "2 Dopple Mirror"}, "2017-01-12": {"bonus": "The quantity of Silver harvested by miners is increased by 150%.", "id": "39028", "quest": "12 Silver"}, "2017-01-13": {"bonus": "Stars will appear on monster groups more quickly than usual in the Frozen Lake area: one star will appear every 15 minutes.", "id": "53646", "quest": "2 Pingwinkle Feather"}, "2017-01-14": {"bonus": "Experience gained in the Asparah Gorge area is increased by 100%.", "id": "47678", "quest": "2 Yomi Snowfoux Malleolus"}, "2017-01-15": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Putrid Peat Bog area.", "id": "15093", "quest": "2 Ouassingue Slobber"}, "2017-01-16": {"bonus": "The chances of obtaining loot from Ghosts are increased by 75%.", "id": "15094", "quest": "2 Family Relic"}, "2017-01-17": {"bonus": "An extra challenge is generated for fights against creatures in the Arachnee family.", "id": "103035", "quest": "7 Arachnee Leg"}, "2017-01-18": {"bonus": "The quantity of Pike , Eel , Perch , and Monkfish harvested by fishermen is increased by 150%.", "id": "41290", "quest": "14 Lard Bass"}, "2017-01-19": {"bonus": "Experience gained by fighting creatures in the Pandissident family is increased by 75%.", "id": "54002", "quest": "3 Pandora Hair"}, "2017-01-20": {"bonus": "The chances of obtaining loot in the Bonta Rat Dungeon are increased by 125%.", "id": "15095", "quest": "2 Jumpy Flea"}, "2017-01-21": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Edge of the Evil Forest area.", "id": "79177", "quest": "1 Bottle of Greedoburg"}, "2017-01-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dark Jungle area: one star will appear every 10 minutes.", "id": "36011", "quest": "2 Warguerite Bract"}, "2017-01-23": {"bonus": "The quantity of Ground Meat harvested by Hunters is increased by 125%.", "id": "175008", "quest": "5 Ground Meat"}, "2017-01-24": {"bonus": "The loot generated by Perceptors is increased by 300% in the Soft Oak Clearing .", "id": "108230", "quest": "2 Short-Tempered Dark Treechnid Bud"}, "2017-01-25": {"bonus": "Experience gained in the Primitive Cemetery area is increased by 100%.", "id": "47640", "quest": "2 Koalak Gravedigger Shinbone"}, "2017-01-26": {"bonus": "Smiths save 10% of their ingredients when they craft items.", "id": "7001", "quest": "3 Twiggy Hammer"}, "2017-01-27": {"bonus": "The quantity of Frosteez harvested by farmers is increased by 150%.", "id": "34552", "quest": "10 Frosteez"}, "2017-01-28": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Amakna Castle Rat Dungeon .", "id": "65521", "quest": "2 Ratter Tail"}, "2017-01-29": {"bonus": "The chances of obtaining loot in the Gobball Corner area are increased by 100%.", "id": "57056", "quest": "11 Gobball Wool"}, "2017-01-30": {"bonus": "An extra challenge is generated for fights against monsters in the Dark Jungle area.", "id": "36010", "quest": "2 Gwass Sepal"}, "2017-01-31": {"bonus": "The quantity of Wild Mint Leaves harvested by alchemists is increased by 125%.", "id": "36052", "quest": "15 Wild Mint"}, "2017-02-01": {"bonus": "Health Points are regenerated 300% more quickly than usual (outside of fights), and heals with consumables are 100% more effective than usual.", "id": "12038", "quest": "4 Superior Mini Healing Potion"}, "2017-02-02": {"bonus": "Experience gains and the chances of dropping loot are increased by 75% against all creatures considered to be in the Gobball family, including Mastogobs and Gobkools.", "id": "69825", "quest": "6 Meat Roulade"}, "2017-02-03": {"bonus": "For each item crafted, Fishermen have a 25% chance of creating a second one.", "id": "49083", "quest": "6 Sliced Gudgeon"}, "2017-02-04": {"bonus": "Experience gained in the Fangs of Glass area is increased by 100%.", "id": "47681", "quest": "2 Icy Brockhard Molar"}, "2017-02-05": {"bonus": "The chances of obtaining loot in the Bulb Cavern dungeon are increased by 125%.", "id": "59041", "quest": "4 Grass Snake Skin"}, "2017-02-06": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Scaraleaf Plain area.", "id": "9007", "quest": "8 Wisdom Ring"}, "2017-02-07": {"bonus": "Stars will appear on monster groups more quickly than usual in the Nolifis Island area: one star will appear every 5 minutes.", "id": "47006", "quest": "2 Pandulum Ghost Bone"}, "2017-02-08": {"bonus": "The quantity of Ash Wood harvested by lumberjacks is increased by 125%.", "id": "38017", "quest": "30 Ash Wood"}, "2017-02-09": {"bonus": "Experience gained by fighting Kanigers is increased by 150%.", "id": "47559", "quest": "4 Kaniger Nail"}, "2017-02-10": {"bonus": "All varieties of Ginger Dragoturkey will give birth to one extra baby.", "id": "47596", "quest": "5 Ginger Dragoturkey Peak"}, "2017-02-11": {"bonus": "The chances of obtaining loot in the Frozen Lake area are increased by 100%.", "id": "54675", "quest": "2 Mama Pingwin Down"}, "2017-02-12": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Boowolf family.", "id": "47106", "quest": "7 Boowolf Canine"}, "2017-02-13": {"bonus": "The quantity of Copper harvested by miners is increased by 150%.", "id": "39108", "quest": "20 Copper"}, "2017-02-14": {"bonus": "Anybody affected by the Chocrosis Curse will see experience gained by fighting monsters increase by 100%.", "id": "42004", "quest": "5 Passion Shigekax"}, "2017-02-15": {"bonus": "Experience gained in the Soft Oak Clearing is increased by 125%.", "id": "36015", "quest": "2 Healing Branch Leaf"}, "2017-02-16": {"bonus": "Hunters save 10% of their ingredients when they craft items.", "id": "175008", "quest": "3 Ground Meat"}, "2017-02-17": {"bonus": "The chances of obtaining loot from creatures in the Mushroom family are increased by 75%.", "id": "15001", "quest": "11 Mushroom"}, "2017-02-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Ancestral Domain .", "id": "108104", "quest": "5 Treechnid Bud"}, "2017-02-19": {"bonus": "The quantity of fish harvested by fishermen of all levels is increased by 100%.", "id": "41277", "quest": "25 Kittenfish"}, "2017-02-20": {"bonus": "An extra challenge is generated for fights against monsters in the Tree Keeholo Trunk area.", "id": "15022", "quest": "2 Air Pikoko Rump"}, "2017-02-21": {"bonus": "Experience gained in the Gisgoul, the Devastated Village area is increased by 100%.", "id": "37001", "quest": "8 Bwork Beer"}, "2017-02-22": {"bonus": "The chances of obtaining loot in the Dreggons' Sanctuary area are increased by 100%.", "id": "59609", "quest": "2 Dragostess Skin"}, "2017-02-23": {"bonus": "Resources will reappear 150% more quickly than usual in the Cania Fields area.", "id": "34154", "quest": "20 Oats"}, "2017-02-24": {"bonus": "Stars will appear on monster groups more quickly than usual in the Astrub Deep Tunnels area: one star will appear every 5 minutes.", "id": "47037", "quest": "4 Tofu Beak"}, "2017-02-25": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Nolifis Island area.", "id": "47003", "quest": "2 Leopardo Ghost Bone"}, "2017-02-26": {"bonus": "Experience gained by fighting creatures in the Mino family is increased by 75%.", "id": "59604", "quest": "3 Minoskito Skin"}, "2017-02-27": {"bonus": "The quantity of Bloody Meat harvested by Hunters is increased by 125%.", "id": "63453", "quest": "3 Bloody Meat"}, "2017-02-28": {"bonus": "Trikortritt Surprises have been added to monster loot.", "id": "49081", "quest": "8 Grawn Fritters"}, "2017-02-29": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Brakmar area.", "id": "4008", "quest": "1 Sacred Staff"}, "2017-03-01": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Brakmar area.", "id": "4008", "quest": "1 Sacred Staff"}, "2017-03-02": {"bonus": "Experience gained in the Agony V'Helley area is increased by 100%.", "id": "47031", "quest": "2 Adventurer Skull"}, "2017-03-03": {"bonus": "The quantity of Hornbeam Wood and Dark Bamboo Wood harvested by lumberjacks is increased by 150%.", "id": "38138", "quest": "3 Hornbeam Wood"}, "2017-03-04": {"bonus": "Stars will appear on monster groups more quickly than usual in the Petrified Forest area: one star will appear every 10 minutes.", "id": "119002", "quest": "2 Fistulina Volva"}, "2017-03-05": {"bonus": "An extra challenge is generated for fights against Moon pirates .", "id": "15088", "quest": "2 Hazwonarm Headband"}, "2017-03-06": {"bonus": "The chances of obtaining loot in the Frigost Village area are increased by 100%.", "id": "55731", "quest": "2 Stunted Rat Fabric"}, "2017-03-07": {"bonus": "Experience gained in the Pandikazes' Hideout dungeon is increased by 125%.", "id": "47664", "quest": "2 Giddy Pandikaze Claw"}, "2017-03-08": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Wabbit family.", "id": "103440", "quest": "7 Wabbit Paw"}, "2017-03-09": {"bonus": "The quantity of Hops harvested by farmers is increased by 125%.", "id": "34080", "quest": "20 Hop"}, "2017-03-10": {"bonus": "All varieties of Indigo Dragoturkey will give birth to one extra baby.", "id": "15424", "quest": "2 Dragoturkey Milk"}, "2017-03-11": {"bonus": "An extra challenge is generated for fights against monsters in the Bottomless Peat Bog area.", "id": "47698", "quest": "2 Miremop Tooth"}, "2017-03-12": {"bonus": "Fishermen save 10% of their ingredients when they craft items.", "id": "41269", "quest": "20 Breaded Fish"}, "2017-03-13": {"bonus": "Experience gained by fighting dungeon bosses is increased by 100%.", "id": "4003", "quest": "2 Staff Bonely"}, "2017-03-14": {"bonus": "The quantity of Five-Leaf Clovers harvested by alchemists is increased by 125%.", "id": "36067", "quest": "15 Five-Leaf Clover"}, "2017-03-15": {"bonus": "The chances of obtaining loot from Plains Boars are increased by 150%.", "id": "15540", "quest": "2 Plain Boar Snout"}, "2017-03-16": {"bonus": "Experience gained in the Zoth Village area is increased by 100%.", "id": "15099", "quest": "2 Zoth Girl's Toy"}, "2017-03-17": {"bonus": "Ayerish Kaffee is waiting near the Amakna Village Inn for adventurers who want to join him for a drink.", "id": "51145", "quest": "1 Emerald Stone"}, "2017-03-18": {"bonus": "Experience gained in the professions related to weapon and equipment crafting (Smiths, Carvers, Jewellers, Shoemakers, Tailors, and Artificers) is increased by 50%.", "id": "7012", "quest": "1 Birming Hammer"}, "2017-03-19": {"bonus": "The quantity of Manganese harvested by miners is increased by 150%.", "id": "39397", "quest": "15 Manganese"}, "2017-03-20": {"bonus": "The chances of obtaining loot in the Sakai Abandoned Mine dungeon are increased by 125%.", "id": "51466", "quest": "2 Drilla Stone"}, "2017-03-21": {"bonus": "Experience gained by fighting Gobballs is increased by 150%.", "id": "15057", "quest": "6 Gobball Slobber"}, "2017-03-22": {"bonus": "An extra challenge is generated for fights against Plain Cracklers .", "id": "51455", "quest": "3 Pointed Stone Fragment"}, "2017-03-23": {"bonus": "All types of wood will reappear 100% more quickly than usual.", "id": "38086", "quest": "20 Chestnut Wood"}, "2017-03-24": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Cania Fields area.", "id": "34082", "quest": "20 Barley"}, "2017-03-25": {"bonus": "The chances of obtaining loot in the Snowfoux Caverns area are increased by 100%.", "id": "57657", "quest": "2 Maho Snowfoux Wool"}, "2017-03-26": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Bearbarian Hive area.", "id": "106634", "quest": "2 Apewicubic Bearbarian Ear"}, "2017-03-27": {"bonus": "The quantity of Maggoty Meat harvested by Hunters is increased by 125%.", "id": "63420", "quest": "4 Maggoty Meat"}, "2017-03-28": {"bonus": "An extra challenge is generated for fights against Mastogobs .", "id": "47661", "quest": "2 Mastogob Warrior Horn"}, "2017-03-29": {"bonus": "Stars will appear on monster groups more quickly than usual in the Alma's Cradle area: one star will appear every 10 minutes.", "id": "55733", "quest": "2 Vigi Pirate Fabric"}, "2017-03-30": {"bonus": "The chances of obtaining loot from creatures in the Kitsou family are increased by 75%.", "id": "59046", "quest": "5 Kitsou Nae Skin"}, "2017-03-31": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Larva Dungeon .", "id": "47654", "quest": "2 Emerald Larva Tooth"}, "2017-04-01": {"bonus": "Experience gained and the chances of dropping loot are increased by 75% against all monsters considered to be marine creatures (beach monsters, Crabs, Coralators, Craborals, Moon Turtles, Gullipops, Giant Kralove).", "id": "15100", "quest": "2 Glacial Fluid"}, "2017-04-02": {"bonus": "The quantity of small river fish (Gudgeon, Trout, Kittenfish, Ediem Carp) and small sea fish (Grawn, Crab Surimi, Breaded Fish, Shiny Sardine) harvested by fishermen is increased by 125%.", "id": "41273", "quest": "16 Crab Surimi"}, "2017-04-03": {"bonus": "Experience gained in the Nolifis Island area is increased by 100%.", "id": "47002", "quest": "2 Yokai Firefoux Ghost Bone"}, "2017-04-04": {"bonus": "Artificers save 10% of their ingredients when they craft items.", "id": "82020", "quest": "2 Gobball Shield"}, "2017-04-05": {"bonus": "Experience gained in the Crackler Dungeon is increased by 125%.", "id": "47418", "quest": "1 Crackler's Gold Tooth"}, "2017-04-06": {"bonus": "The chances of obtaining loot in the Road to Brakmar area are increased by 100%.", "id": "54008", "quest": "7 Boowolf Hair"}, "2017-04-07": {"bonus": "The quantity of Barley harvested by farmers is increased by 125%.", "id": "34082", "quest": "20 Barley"}, "2017-04-08": {"bonus": "Experience gained by fighting Moon Beach Monsters is increased by 75%.", "id": "24018", "quest": "2 Green Carapace"}, "2017-04-09": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Inner Labyrinth of the Minotoror dungeon.", "id": "107735", "quest": "2 Scaratos Carapace"}, "2017-04-10": {"bonus": "All varieties of Crimson Dragoturkey will give birth to one extra baby.", "id": "93002", "quest": "1 Ash Manger"}, "2017-04-11": {"bonus": "Stars will appear on monster groups more quickly than usual in the Cania Lake area: one star will appear every 5 minutes.", "id": "15281", "quest": "9 Piece of Coco Blop"}, "2017-04-12": {"bonus": "The chances of obtaining loot from Pandala ghosts are increased by 75%.", "id": "47004", "quest": "2 Pandikaze Ghost Bone"}, "2017-04-13": {"bonus": "The quantity of Ebony Wood and Kaliptus Wood harvested by lumberjacks is increased by 150%.", "id": "38001", "quest": "8 Kaliptus Wood"}, "2017-04-14": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Zoth Village monsters .", "id": "4062", "quest": "2 Zoth Pipe"}, "2017-04-15": {"bonus": "For each item crafted, handymen have a 25% chance of creating a second one.", "id": "93005", "quest": "1 Ash Slapper"}, "2017-04-16": {"bonus": "A special repeatable quest is available today near the Masqueraider Temple .", "id": "105648", "quest": "4 White Dreggon Egg"}, "2017-04-17": {"bonus": "The chances of obtaining loot in the Jelly Peninsula area are increased by 100%.", "id": "110040", "quest": "2 Strawberry Jelly"}, "2017-04-18": {"bonus": "An extra challenge is generated for fights against Bearbarians .", "id": "65762", "quest": "2 Mellifluous Bearbarian Tail"}, "2017-04-19": {"bonus": "The quantity of Gold harvested by miners is increased by 150%.", "id": "39022", "quest": "10 Gold"}, "2017-04-20": {"bonus": "Experience gained in the Border of Feudala area is increased by 100%.", "id": "54202", "quest": "3 Maho Firefoux Hair"}, "2017-04-21": {"bonus": "The chances of obtaining loot in the Inner Labyrinth of the Minotoror dungeon are increased by 125%.", "id": "47699", "quest": "2 Minokid Horn"}, "2017-04-22": {"bonus": "Resources will reappear 150% more quickly than usual in the Kawaii River and Madrestam Harbour areas.", "id": "41305", "quest": "10 Ediem Carp"}, "2017-04-23": {"bonus": "Experience gained by fighting Peat Bog monsters is increased by 75%.", "id": "15093", "quest": "2 Ouassingue Slobber"}, "2017-04-24": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Crackler Mountain area.", "id": "51127", "quest": "2 Crackler Stone"}, "2017-04-25": {"bonus": "The quantity of Stale Meat harvested by Hunters is increased by 125%.", "id": "63473", "quest": "3 Stale Meat"}, "2017-04-26": {"bonus": "Kamas gained are increased by 100% for all quests.", "id": "141010", "quest": "2 Suspicious Pouch"}, "2017-04-27": {"bonus": "Stars will appear on monster groups more quickly than usual in the Rocky Roads area: one star will appear every 15 minutes.", "id": "106562", "quest": "3 Foxfyter Ear"}, "2017-04-28": {"bonus": "Miners save 10% of their ingredients when they craft items.", "id": "50098", "quest": "1 Crystal"}, "2017-04-29": {"bonus": "The chances of obtaining loot from creatures in the Piwi family are increased by 75%.", "id": "53117", "quest": "4 Red Piwi Feather"}, "2017-04-30": {"bonus": "The quantity of plants harvested by alchemists of all levels is increased by 100%.", "id": "36643", "quest": "20 Sage"}, "2017-05-01": {"bonus": "For every Fairywork crafted, characters have a 25% chance of creating a second one, as well as a 10% change of keeping their ingredients.", "id": "15711", "quest": "2 Explosive Capsule"}, "2017-05-02": {"bonus": "Experienced gained in the Fungus Dungeon is increased by 125%.", "id": "15765", "quest": "1 Mushmunch Tongue"}, "2017-05-03": {"bonus": "The chances of obtaining loot from Tree Keeholo monsters are increased by 75%.", "id": "38003", "quest": "2 Light Treeckler Stump"}, "2017-05-04": {"bonus": "Bonuses gained by completing challenges are increased by 250% against Onis .", "id": "15662", "quest": "1 Oni Blood"}, "2017-05-05": {"bonus": "An extra challenge is generated for fights against monsters in the Grassy Plains area.", "id": "15015", "quest": "2 Mufafah Moustache"}, "2017-05-06": {"bonus": "The quantity of Bombu , Oliviolet and Maple harvested by lumberjacks is increased by 125%.", "id": "38153", "quest": "15 Maple Wood"}, "2017-05-07": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Frigost Village and Icefields areas.", "id": "69750", "quest": "5 Meatball"}, "2017-05-08": {"bonus": "A special repeatable quest is available today near Amakna Castle .", "id": "68135", "quest": "10 Potatoes"}, "2017-05-09": {"bonus": "The chances of obtaining loot in the Wild Canyon area are increased by 100%.", "id": "51496", "quest": "2 Medicinal Stone"}, "2017-05-10": {"bonus": "All varieties of Turquoise Dragoturkey will give birth to one extra baby.", "id": "8001", "quest": "3 Twiggy Shovel"}, "2017-05-11": {"bonus": "Experience gained in the Scaraleaf Plain area is increased by 100%.", "id": "107444", "quest": "1 Green Scaraleaf Carapace"}, "2017-05-12": {"bonus": "The quantity of Malt harvested by farmers is increased by 125%.", "id": "34083", "quest": "20 Malt"}, "2017-05-13": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Skeunk's Hideout dungeon.", "id": "15804", "quest": "1 Emeralda's Skeunk Autograph"}, "2017-05-14": {"bonus": "The quality of items crafted in the city of Astrub is increased.", "id": "5003", "quest": "2 Smithy Daggers"}, "2017-05-15": {"bonus": "Gobbowl Surprises have been added to monster loot.", "id": "57056", "quest": "11 Gobball Wool"}, "2017-05-16": {"bonus": "Plants harvested by alchemists will reappear 100% more quickly than usual.", "id": "36642", "quest": "40 Nettles"}, "2017-05-17": {"bonus": "The chances of obtaining loot from Mopy Kings are increased by 150%.", "id": "55019", "quest": "2 Mopy King Fabric"}, "2017-05-18": {"bonus": "Stars will appear on monster groups more quickly than usual in the Pandala Forest area: one star will appear every 5 minutes.", "id": "35119", "quest": "3 Bulbiflor Flower"}, "2017-05-19": {"bonus": "The quantity of Tin and Silicate harvested by miners is increased by 150%.", "id": "39078", "quest": "12 Tin"}, "2017-05-20": {"bonus": "Experience gained by fighting temple Dopples is increased by 75%.", "id": "15816", "quest": "2 Carbon Paper"}, "2017-05-21": {"bonus": "Tailors have a 10% chance of keeping their ingredients when they craft items.", "id": "17065", "quest": "1 Purple Cloak"}, "2017-05-22": {"bonus": "An extra challenge is generated for fights against monsters in the Snowfoux Caverns area.", "id": "57658", "quest": "2 Yokai Snowfoux Wool"}, "2017-05-23": {"bonus": "The quantity of Perch , Monkfish , Lard Bass , and Tench harvested by fishermen is increased by 150%.", "id": "41313", "quest": "12 Perch"}, "2017-05-24": {"bonus": "The chances of obtaining loot in the Field Dungeon are increased by 125%.", "id": "58006", "quest": "3 Wild Sunflower Seed"}, "2017-05-25": {"bonus": "The resource protectors are 5 times more likely to appear during harvesting activities than usual.", "id": "81026", "quest": "1 Small Harvester Bag"}, "2017-05-26": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Amakna Castle Gobball Breeding Station area.", "id": "47055", "quest": "6 Gobball Horn"}, "2017-05-27": {"bonus": "For each item crafted, Farmers have a 25% chance of creating a second one.", "id": "33012", "quest": "10 Solid Bread"}, "2017-05-28": {"bonus": "The quantity of Blood-Soaked Meat harvested by hunters is increased by 125%.", "id": "63464", "quest": "2 Blood-Soaked Meat"}, "2017-05-29": {"bonus": "Stars will appear on monster groups more quickly than usual in the Kaliptus Forest area: one star will appear every 5 minutes.", "id": "54004", "quest": "2 Koalak Forester Hair"}, "2017-05-30": {"bonus": "Experience gained by fighting Dreggons is increased by 75%.", "id": "111202", "quest": "7 Golden Dreggon Shell"}, "2017-05-31": {"bonus": "The chances of obtaining loot in the Petrified Forest area are increased by 100%.", "id": "119001", "quest": "2 Dramanita Gill"}, "2017-06-01": {"bonus": "An extra challenge is generated for fights against creatures in the Beach monsters family.", "id": "47051", "quest": "5 Crab Pincer"}, "2017-06-02": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Madrestam Harbour area.", "id": "41317", "quest": "15 Shiny Sardine"}, "2017-06-03": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Blacksmith Dungeon .", "id": "58472", "quest": "2 Seed of Contention"}, "2017-06-04": {"bonus": "The loot generated by Perceptors is increased by 200% in all areas.", "id": "15131", "quest": "2 Counterfeit Royal Seal"}, "2017-06-05": {"bonus": "A special repeatable quest is available today to the east of the Lumberjacks' Workshop in Amakna Forest .", "id": "68031", "quest": "1 Cawwot"}, "2017-06-06": {"bonus": "The chances of obtaining loot from Count Harebourg , his four lieutenants and all their creatures are increased by 75%.", "id": "109602", "quest": "2 Harrogant Eye"}, "2017-06-07": {"bonus": "Experience gained by fighting Snowfoux is increased by 75%.", "id": "47685", "quest": "2 Kami Snowfoux Incisor"}, "2017-06-08": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Pandala Forest area.", "id": "36056", "quest": "2 Bulbamboo Shoot"}, "2017-06-09": {"bonus": "The quantity of Freyesque Orchids harvested by alchemists is increased by 150%.", "id": "35192", "quest": "10 Freyesque Orchid"}, "2017-06-10": {"bonus": "All varieties of Almond Dragoturkey will give birth to one extra baby.", "id": "47597", "quest": "5 Almond Dragoturkey Peak"}, "2017-06-11": {"bonus": "The chances of obtaining loot in the Turtle Beach area are increased by 100%.", "id": "15433", "quest": "2 Kokostraw"}, "2017-06-12": {"bonus": "The quality of items crafted in the city of Frigost Village is increased.", "id": "3002", "quest": "2 Ice Wand"}, "2017-06-13": {"bonus": "Experience gained in the Fungus Cavern area is increased by 100%.", "id": "15045", "quest": "1 Mush Rhume Slobber"}, "2017-06-14": {"bonus": "Handymen have a 10% chance of keeping their ingredients when they craft items.", "id": "84013", "quest": "1 Field Dungeon Key"}, "2017-06-15": {"bonus": "The quantity of Cherry Wood harvested by lumberjacks is increased by 125%.", "id": "38139", "quest": "12 Cherry Wood"}, "2017-06-16": {"bonus": "An extra challenge is generated for fights against monsters in the Dreggon Village area.", "id": "111211", "quest": "7 Sapphire Dreggon Shell"}, "2017-06-17": {"bonus": "The chances of obtaining loot from Bulbigs are increased by 150%.", "id": "98144", "quest": "2 Bulbig Root"}, "2017-06-18": {"bonus": "Experienced gained in the Dreggon Dungeon is increased by 125%.", "id": "59610", "quest": "2 Flying Dreggon Skin"}, "2017-06-19": {"bonus": "Bonuses gained by completing challenges are increased by 250% against Kitsou Nufeus .", "id": "59044", "quest": "5 Kitsou Nufeu Skin"}, "2017-06-20": {"bonus": "The quantity of Wheat harvested by farmers is increased by 125%.", "id": "34009", "quest": "40 Wheat"}, "2017-06-21": {"bonus": "The fees charged for using Zaaps , bank accounts and markets are all reduced by 50%.", "id": "15813", "quest": "2 Marine Conch"}, "2017-06-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Coral Beach area: one star will appear every 15 minutes.", "id": "47017", "quest": "2 Craboral Pincer"}, "2017-06-23": {"bonus": "The chances of obtaining loot in the Tree Keeholo Foliage area are increased by 100%.", "id": "15006", "quest": "2 Snailmet Slobber"}, "2017-06-24": {"bonus": "Experience gained by fighting Field Plants is increased by 75%.", "id": "36555", "quest": "4 Evil Dandelion Tongue"}, "2017-06-25": {"bonus": "Resources will reappear 150% more quickly than usual in the Sidimote Moors area.", "id": "39024", "quest": "40 Iron"}, "2017-06-26": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in Pandala Village and the surrounding area.", "id": "82004", "quest": "1 Lumberjack Shield"}, "2017-06-27": {"bonus": "The chances of obtaining loot in the Lair of the Giant Kralove dungeon are increased by 125%.", "id": "15817", "quest": "2 Old Kralove Sucker"}, "2017-06-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Arak-hai Forest area: one star will appear every 10 minutes.", "id": "98102", "quest": "7 Treechnid Root"}, "2017-06-29": {"bonus": "The quantity of Contaminated Meat harvested by Hunters is increased by 125%.", "id": "63491", "quest": "4 Contaminated Meat"}, "2017-06-30": {"bonus": "Experience gained in the Minotoror Island area is increased by 100%.", "id": "59602", "quest": "3 Manderisha Skin"}, "2017-07-01": {"bonus": "The chances of obtaining loot from Crocodyl Chiefs are increased by 150%.", "id": "59547", "quest": "4 Crocodyl Chief Scale"}, "2017-07-02": {"bonus": "An extra challenge is generated for fights against monsters in the Amakna Forest area.", "id": "47059", "quest": "6 Boar Tusk"}, "2017-07-03": {"bonus": "Alchemists have a 10% chance of keeping their ingredients when they craft items.", "id": "12016", "quest": "7 Mini Healing Potion"}, "2017-07-04": {"bonus": "The quality of items crafted in Amakna Village and Forest is increased.", "id": "33011", "quest": "2 Sesame Seed Bread"}, "2017-07-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Kitsoune Dungeon .", "id": "54559", "quest": "1 Kitsou Nakwa Hair"}, "2017-07-06": {"bonus": "The quantity of Kittenfish , Ediem Carp , Pike , and Eel harvested by fishermen is increased by 150%.", "id": "41277", "quest": "40 Kittenfish"}, "2017-07-07": {"bonus": "The chances of obtaining loot in the Tears of Ouronigride area are increased by 100%.", "id": "51471", "quest": "2 Solfatara Residue"}, "2017-07-08": {"bonus": "Experience gained by fighting Gobkools and Cave Gobballs is increased by 200%.", "id": "57001", "quest": "8 Gobkool Wool"}, "2017-07-09": {"bonus": "Experience gains are increased by 50% for all harvesting professions .", "id": "38017", "quest": "20 Ash Wood"}, "2017-07-10": {"bonus": "All varieties of Plum Dragoturkey will give birth to one extra baby.", "id": "2020", "quest": "1 Eco Bow"}, "2017-07-11": {"bonus": "The quantity of Bauxite harvested by miners is increased by 150%.", "id": "39076", "quest": "10 Bauxite"}, "2017-07-12": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Icefields area.", "id": "57211", "quest": "2 Mastogob Wool"}, "2017-07-13": {"bonus": "Experience gained in the Tears of Ouronigride area is increased by 100%.", "id": "51469", "quest": "2 Atomystique Stone"}, "2017-07-14": {"bonus": "Experience gained from Kolossium fights is increased by 100%.", "id": "15245", "quest": "2 Broken Chains"}, "2017-07-15": {"bonus": "The quantity of Marbled Meat harvested by Hunters is increased by 125%.", "id": "63457", "quest": "3 Marbled Meat"}, "2017-07-16": {"bonus": "The chances of obtaining loot from Vulkania monsters are increased by 75%.", "id": "15793", "quest": "2 Venerable Mud"}, "2017-07-17": {"bonus": "Stars will appear on monster groups more quickly than usual in the Astrub Meadow area: one star will appear every 10 minutes.", "id": "35018", "quest": "4 Evil Dandelion Flower"}, "2017-07-18": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Gobball Corner area.", "id": "26016", "quest": "5 Shrubstrate"}, "2017-07-19": {"bonus": "Experience gained in the Grotto Hesque is increased by 125%.", "id": "47012", "quest": "2 Coralator Coccyx"}, "2017-07-20": {"bonus": "Cereals harvested by farmers will reappear 100% more quickly than usual.", "id": "60061", "quest": "1 Wild Sunflower Oil"}, "2017-07-21": {"bonus": "The chances of obtaining loot in the Zoth Village area are increased by 100%.", "id": "50716", "quest": "2 Precious Zoth Stone"}, "2017-07-22": {"bonus": "An extra challenge is generated for fights against Frigost Village monsters .", "id": "53648", "quest": "2 Gullipop Feather"}, "2017-07-23": {"bonus": "Pet and petsmount bonuses are increased by 100%.", "id": "41292", "quest": "40 Grawn"}, "2017-07-24": {"bonus": "The quantity of Aspen , Holy Bamboo and Elm wood harvested by lumberjacks is increased by 200%.", "id": "38140", "quest": "1 Elm Wood"}, "2017-07-25": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Pig family.", "id": "59618", "quest": "1 Blodz Uker Skin"}, "2017-07-26": {"bonus": "Experience gained in the Lonesome Pine Trails area is increased by 100%.", "id": "65754", "quest": "2 Cromagmunk Tail"}, "2017-07-27": {"bonus": "Hunters have a 10% chance of keeping their ingredients when they craft items.", "id": "69115", "quest": "8 Astrubian Fritter"}, "2017-07-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Snowy Forest and Sakai Plain areas: one star will appear every 5 minutes.", "id": "47670", "quest": "2 Stabba Fibula"}, "2017-07-29": {"bonus": "The chances of obtaining loot in the Daggero's Lair dungeon are increased by 125%.", "id": "59045", "quest": "5 Kitsou Nere Skin"}, "2017-07-30": {"bonus": "Experience gains and the chances of dropping loot are increased by 125% in the Haunted House dungeon.", "id": "15089", "quest": "4 Vampire Blood"}, "2017-07-31": {"bonus": "Experience gained by fighting Vulkania monsters is increased by 75%.", "id": "48281", "quest": "2 Novice Powder"}, "2017-08-01": {"bonus": "The quantity of Edelweiss and Pandkin Seeds harvested by alchemists is increased by 175%.", "id": "35191", "quest": "10 Edelweiss"}, "2017-08-02": {"bonus": "The chances of obtaining loot from creatures in the Tofu family are increased by 75%.", "id": "105038", "quest": "5 Tofu Egg"}, "2017-08-03": {"bonus": "A special repeatable quest is available today just south of the Bonta gate.", "id": "12144", "quest": "3 Bontarian Intercity-Express Potion"}, "2017-08-04": {"bonus": "An extra challenge is generated for fights against Vulkania monsters .", "id": "48282", "quest": "2 Mature Ashes"}, "2017-08-05": {"bonus": "The quantity of Icefish harvested by fishermen is increased by 150%.", "id": "41403", "quest": "3 Icefish"}, "2017-08-06": {"bonus": "Experience gained in the Astrub Rocky Inlet area is increased by 100%.", "id": "15814", "quest": "2 Suntan Lotion"}, "2017-08-07": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Royal Rainbow Blop Lair dungeon.", "id": "98001", "quest": "2 Trunkiblop Root"}, "2017-08-08": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in Bonta .", "id": "11003", "quest": "4 Mulish Cat's Boots"}, "2017-08-09": {"bonus": "The quantity of cereals harvested by farmers of all levels is increased by 100%.", "id": "34009", "quest": "40 Wheat"}, "2017-08-10": {"bonus": "Fertile Dragoturkeys of all varieties will give birth to one extra baby.", "id": "47598", "quest": "2 Golden Dragoturkey Peak"}, "2017-08-11": {"bonus": "The chances of obtaining loot in the Nolifis Island area are increased by 100%.", "id": "47007", "quest": "2 Soryo Firefoux Ghost Bone"}, "2017-08-12": {"bonus": "Experience gained by fighting Moon Kanniballs is increased by 75%.", "id": "164077", "quest": "2 Kanniballs"}, "2017-08-13": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Vulkania monsters .", "id": "15794", "quest": "2 Juvenile Puddle"}, "2017-08-14": {"bonus": "Resources will reappear 150% more quickly than usual in the Amkana Forest area.", "id": "36052", "quest": "15 Wild Mint"}, "2017-08-15": {"bonus": "Stars will appear on monster groups more quickly than usual in all areas: one star will appear every 30 minutes.", "id": "15815", "quest": "2 Starfish Eyelid"}, "2017-08-16": {"bonus": "Experience gained in the Squirming Snapper area is increased by 100%.", "id": "15797", "quest": "2 Poacher's Armband"}, "2017-08-17": {"bonus": "The quantity of Bronze harvested by miners is increased by 150%.", "id": "39109", "quest": "20 Bronze"}, "2017-08-18": {"bonus": "The chances of obtaining loot from creatures in the Mino family are increased by 75%.", "id": "47699", "quest": "2 Minokid Horn"}, "2017-08-19": {"bonus": "Farmers have a 10% chance of keeping their ingredients when they craft items.", "id": "34080", "quest": "20 Hop"}, "2017-08-20": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Lousy Pig Plain area.", "id": "56141", "quest": "3 Piglet Leather"}, "2017-08-21": {"bonus": "Stars will appear on monster groups more quickly than usual in the Vulkanian Forest areas: one star will appear every 10 minutes.", "id": "15795", "quest": "2 Juvenile Smoke"}, "2017-08-22": {"bonus": "The quantity of Mineral Meat harvested by Hunters is increased by 125%.", "id": "63411", "quest": "4 Mineral Meat"}, "2017-08-23": {"bonus": "The chances of obtaining loot in the Mount Scauldron area are increased by 100%.", "id": "54682", "quest": "2 Torpid Bearbarian Hair"}, "2017-08-24": {"bonus": "Experience gained in the Bworker Dungeon is increased by 125%.", "id": "15819", "quest": "2 Mama Bwork Boil"}, "2017-08-25": {"bonus": "An extra challenge is generated for fights against monsters in the Ingalsses' Fields area.", "id": "35632", "quest": "3 Wild Sunflower Petal"}, "2017-08-26": {"bonus": "The loot generated by Perceptors is increased by 300% in the Dreggon Dungeon .", "id": "59609", "quest": "2 Dragostess Skin"}, "2017-08-27": {"bonus": "Experience gained by fighting Alma's Cradle monsters is increased by 75%.", "id": "59631", "quest": "2 Harpy Pirate Scale"}, "2017-08-28": {"bonus": "The quantity of Walnut Wood harvested by lumberjacks is increased by 150%.", "id": "38095", "quest": "20 Walnut Wood"}, "2017-08-29": {"bonus": "The chances of obtaining loot in the Blop Dungeon are increased by 125%.", "id": "35008", "quest": "2 Blopshroom Flower"}, "2017-08-30": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dragon Pig's Maze area: one star will appear every 5 minutes.", "id": "59617", "quest": "1 Dorgan Ation Skin"}, "2017-08-31": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Amakna Forest area.", "id": "33011", "quest": "3 Sesame Seed Bread"}, "2017-09-01": {"bonus": "Experience gained in the Enchanted Lakes area is increased by 100%.", "id": "47010", "quest": "2 Fisheralak Bone"}, "2017-09-02": {"bonus": "Experience gains are increased by 50% for all professions.", "id": "12002", "quest": "4 Potion of Old Age"}, "2017-09-03": {"bonus": "The quantity of Nettles harvested by alchemists is increased by 125%.", "id": "36642", "quest": "40 Nettles"}, "2017-09-04": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Fangs of Glass monsters .", "id": "47680", "quest": "2 Bestial Brockhard Claw"}, "2017-09-05": {"bonus": "The chances of obtaining loot in the Neutral Pandala area are increased by 100%.", "id": "36069", "quest": "4 Bambooto Leaf"}, "2017-09-06": {"bonus": "Experience gained in Lord Crow's Library is increased by 125%.", "id": "54005", "quest": "1 Crowfox Hair"}, "2017-09-07": {"bonus": "An extra challenge is generated for fights against Tears of Ouronigride monsters .", "id": "51474", "quest": "2 Mofette Stone"}, "2017-09-08": {"bonus": "The quantity of Breaded Fish , Shiny Sardine , Kralove , and Grey Sea Bream harvested by fishermen is increased by 150%.", "id": "41317", "quest": "15 Shiny Sardine"}, "2017-09-09": {"bonus": "The chances of obtaining loot from Lousy Pig Shepherds are increased by 150%.", "id": "15512", "quest": "2 Broken Trident"}, "2017-09-10": {"bonus": "All varieties of Ebony Dragoturkey will give birth to one extra baby.", "id": "104593", "quest": "1 Almond Dragoturkey Wing"}, "2017-09-11": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dreggons' Sanctuary area: one star will appear every 10 minutes.", "id": "59611", "quest": "2 Dreggon Warrior Skin"}, "2017-09-12": {"bonus": "The experience points awarded for completing alignment quests and city order quests are increased by 100%.", "id": "15247", "quest": "2 Spectral Flame"}, "2017-09-13": {"bonus": "The quantity of Flax harvested by farmers is increased by 125%.", "id": "34122", "quest": "20 Flax"}, "2017-09-14": {"bonus": "Experience gained by fighting Petrified Forest monsters is increased by 75%.", "id": "96668", "quest": "2 Treecherous Bark"}, "2017-09-15": {"bonus": "Jewellers save 10% of their ingredients when they craft items.", "id": "1011", "quest": "3 Rainbow Necklace"}, "2017-09-16": {"bonus": "The chances of obtaining loot in the Icefields area are increased by 100%.", "id": "106624", "quest": "2 Mastogobbly Ear"}, "2017-09-17": {"bonus": "Experience gained in Brouce Boulgoure's Clearing is increased by 100%.", "id": "15049", "quest": "7 Mush Mush Thorn"}, "2017-09-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Skeleton Dungeon .", "id": "47015", "quest": "4 Chafer Bone"}, "2017-09-19": {"bonus": "Experience gains and the chances of dropping loot are increased by 75% against all monsters considered to be pirates.", "id": "38095", "quest": "20 Walnut Wood"}, "2017-09-20": {"bonus": "The quantity of Fresh Meat picked up by hunters is increased by 125%.", "id": "63441", "quest": "3 Fresh Meat"}, "2017-09-21": {"bonus": "The quality of items crafted in the city of Brakmar is increased.", "id": "19013", "quest": "2 Vor'Om Axe"}, "2017-09-22": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Border of Feudala area.", "id": "54205", "quest": "3 Leopardo Hair"}, "2017-09-23": {"bonus": "The chances of obtaining loot from Grassy Plains monsters are increased by 75%.", "id": "54012", "quest": "2 Kilibriss Down"}, "2017-09-24": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Countryside area.", "id": "19006", "quest": "4 Lumberjack Hatchet"}, "2017-09-25": {"bonus": "Experience gained by fighting Crocodyls is increased by 150%.", "id": "47234", "quest": "4 Crocodyl Teeth"}, "2017-09-26": {"bonus": "The quantity of Dolomite and Obsidian harvested by miners is increased by 175%.", "id": "39112", "quest": "21 Obsidian"}, "2017-09-27": {"bonus": "The chances of obtaining loot in the Firefoux Dungeon are increased by 125%.", "id": "54204", "quest": "4 Yokai Firefoux Hair"}, "2017-09-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Labyrinth of the Minotoror area: one star will appear every 5 minutes.", "id": "53004", "quest": "3 Quetsnakiatl Feather"}, "2017-09-29": {"bonus": "An extra challenge is generated for fights against monsters in the Otomai's Ark area.", "id": "15011", "quest": "2 Barbrossa's Shirt"}, "2017-09-30": {"bonus": "The loot generated by Perceptors is increased by 300% in the Kimbo's Canopy dungeon.", "id": "15022", "quest": "2 Air Pikoko Rump"}, "2017-10-01": {"bonus": "Experience gained by fighting Pandala ghosts is increased by 75%.", "id": "47008", "quest": "2 Maho Firefoux Ghost Bone"}, "2017-10-02": {"bonus": "The quantity of Oak Wood harvested by lumberjacks is increased by 150%.", "id": "38092", "quest": "20 Oak Wood"}, "2017-10-03": {"bonus": "A special repeatable quest is available today near the fountain in Amakna Village .", "id": "2001", "quest": "3 Twiggy Bow"}, "2017-10-04": {"bonus": "The chances of obtaining loot in the Milicluster area are increased by 100%.", "id": "47134", "quest": "3 Prespic Peak"}, "2017-10-05": {"bonus": "Fishermen save 10% of their ingredients when they craft items.", "id": "49074", "quest": "3 Crab Stick"}, "2017-10-06": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Tynril Lab dungeon.", "id": "36008", "quest": "2 Floramor Stamen"}, "2017-10-07": {"bonus": "Experience gained in the Dark Forest is increased by 100%.", "id": "98232", "quest": "1 Dark Treechnid Root"}, "2017-10-08": {"bonus": "The quantity of meat harvested by hunters of all levels is increased by 100%.", "id": "63471", "quest": "4 Oozing Meat"}, "2017-10-09": {"bonus": "Experience gained by mounts is increased by 200%.", "id": "69758", "quest": "3 Cottage Pie with Onion"}, "2017-10-10": {"bonus": "All varieties of Golden Dragoturkey will give birth to one extra baby.", "id": "41305", "quest": "10 Ediem Carp"}, "2017-10-11": {"bonus": "The chances of obtaining loot from Tears of Ouronigride monsters are increased by 75%.", "id": "51471", "quest": "2 Solfatara Residue"}, "2017-10-12": {"bonus": "All experience given as a reward for quests is increased by 100%.", "id": "38675", "quest": "3 Bambooto Wood"}, "2017-10-13": {"bonus": "Stars will appear on monster groups more quickly than usual in the Neutral Pandala area: one star will appear every 10 minutes.", "id": "103716", "quest": "4 Araknawa Leg"}, "2017-10-14": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Evil Forest area.", "id": "104048", "quest": "7 Evil Tofu Wing"}, "2017-10-15": {"bonus": "The quantity of Sage harvested by alchemists is increased by 125%.", "id": "36643", "quest": "20 Sage"}, "2017-10-16": {"bonus": "The chances of obtaining loot in the the Koolich Cavern dungeon are increased by 125%.", "id": "47009", "quest": "9 Gobkool Horn"}, "2017-10-17": {"bonus": "Harvesters save 15% of their ingredients when they craft items in the Lonesome Pine Trails area.", "id": "63348", "quest": "3 Rotten Meat"}, "2017-10-18": {"bonus": "Experience gained by fighting Zoths is increased by 75%.", "id": "15130", "quest": "2 Zoth Smoke Machine"}, "2017-10-19": {"bonus": "Fish of all types will reappear 100% more quickly than usual.", "id": "41400", "quest": "15 Pike"}, "2017-10-20": {"bonus": "The chances of obtaining loot on the Dreggon Peninsula are increased by 100%.", "id": "111203", "quest": "7 Black Dreggon Shell"}, "2017-10-21": {"bonus": "", "id": "69804", "quest": "4 Countrywoman Pan Fry"}, "2017-10-22": {"bonus": "Experience gained in the Cradle area is increased by 100%.", "id": "53014", "quest": "7 Tofu Feather"}, "2017-10-23": {"bonus": "Stars will appear on monster groups more quickly than usual in the Sidimote Moors area: one star will appear every 15 minutes.", "id": "53327", "quest": "4 Crobak Feather"}, "2017-10-24": {"bonus": "The quantity of Iron harvested by miners is increased by 150%.", "id": "39024", "quest": "40 Iron"}, "2017-10-25": {"bonus": "The chances of obtaining loot from Lonesome Pine Trail monsters are increased by 75%.", "id": "54676", "quest": "2 Sabredon Hair"}, "2017-10-26": {"bonus": "Experience gained in the Wa Wabbit's Castle is increased by 125%.", "id": "47758", "quest": "5 Wabbit Teeth"}, "2017-10-27": {"bonus": "Carvers save 10% of their ingredients when they craft items.", "id": "3008", "quest": "3 Twiggy Wand"}, "2017-10-28": {"bonus": "The quantity of Hemp harvested by farmers is increased by 125%.", "id": "34121", "quest": "20 Hemp"}, "2017-10-29": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Snowfoux .", "id": "106629", "quest": "2 Soryo Snowfoux Ear"}, "2017-10-30": {"bonus": "An extra challenge is generated for fights against monsters in the Snowy Forest area.", "id": "59630", "quest": "2 Grabba Skin"}, "2017-10-31": {"bonus": "Trikortritt Surprises have been added to monster loot.", "id": "54131", "quest": "4 Bwork Magus Beard Hair"}, "2017-11-01": {"bonus": "Experience gained by fighting monsters and the chances of dropping loot are increased by 50% for all adventurers wearing a pair of pants, briefs or similar.", "id": "56649", "quest": "2 Bwork Archer Briefs"}, "2017-11-02": {"bonus": "The chances of obtaining loot in the Brumen Tinctorias's Laboratory dungeon are increased by 125%.", "id": "15451", "quest": "9 Kolerat Whiskers"}, "2017-11-03": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Amakna Village area.", "id": "17194", "quest": "1 Dark Cloak"}, "2017-11-04": {"bonus": "Experience gained by fighting Bandits and Dark Craftsmen is increased by 75%.", "id": "15131", "quest": "2 Counterfeit Royal Seal"}, "2017-11-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Permafrost Port area.", "id": "54677", "quest": "2 Woolly Bow Meow Hair"}, "2017-11-06": {"bonus": "The quantity of Chestnut Wood harvested by lumberjacks is increased by 125%.", "id": "38086", "quest": "20 Chestnut Wood"}, "2017-11-07": {"bonus": "Experience gained in the Dark Jungle area is increased by 100%.", "id": "36012", "quest": "2 Barkritter Calyx"}, "2017-11-08": {"bonus": "An extra challenge is generated for fights against monsters in the Edge of the Evil Forest area.", "id": "65579", "quest": "2 Prespic Tail"}, "2017-11-09": {"bonus": "The chances of obtaining loot in the Alma's Cradle area are increased by 100%.", "id": "111751", "quest": "2 Yuara Pirate Shell"}, "2017-11-10": {"bonus": "All varieties of Orchid Dragoturkey will give birth to one extra baby.", "id": "41294", "quest": "28 Gudgeon"}, "2017-11-11": {"bonus": "Our Miss Triste is waiting by the fountain in Amakna Village to give adventurers ugly-overs.", "id": "59233", "quest": "4 Crocodyl Scale"}, "2017-11-12": {"bonus": "The quantity of Blue Ray , Sickle-Hammerhead Shark , Cod , and Swordfish harvested by fishermen is increased by 150%.", "id": "41296", "quest": "18 Blue Ray"}, "2017-11-13": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Brakmar Rat Dungeon .", "id": "15133", "quest": "2 Poisonous Slobber"}, "2017-11-14": {"bonus": "The chances of obtaining loot from hostile Dragoturkeys are increased by 75%.", "id": "104592", "quest": "1 Ginger Dragoturkey Wing"}, "2017-11-15": {"bonus": "A special repeatable quest is available today near the statue of the god Sram in Astrub .", "id": "5009", "quest": "2 Leurnettes"}, "2017-11-16": {"bonus": "Experience gained by fighting Sewer monsters is increased by 75%.", "id": "59622", "quest": "2 Grossewer Shaman Skin"}, "2017-11-17": {"bonus": "The quantity of lvl.", "id": "63476", "quest": "1 Macerated Meat"}, "2017-11-18": {"bonus": "An extra challenge is generated for fights against Sewer monsters .", "id": "103034", "quest": "2 Sewer Keeper Leg"}, "2017-11-19": {"bonus": "Lumberjacks save 10% of their ingredients when they craft items.", "id": "26017", "quest": "3 Timber Substrate"}, "2017-11-20": {"bonus": "Stars will appear on monster groups more quickly than usual in the Brakmar City Walls area: one star will appear every 10 minutes.", "id": "103330", "quest": "5 Crobak Foot"}, "2017-11-21": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Tree Keeholo monsters .", "id": "15021", "quest": "2 Cheeken Cloaca"}, "2017-11-22": {"bonus": "The loot generated by Perceptors is increased by 300% in the Canidae Dungeon .", "id": "65105", "quest": "7 Boowolf Tail"}, "2017-11-23": {"bonus": "Bonuses awarded by mounts are increased by 100%.", "id": "63426", "quest": "4 Rancid Meat"}, "2017-11-24": {"bonus": "The quantity of Oats harvested by farmers is increased by 125%.", "id": "34154", "quest": "20 Oats"}, "2017-11-25": {"bonus": "The chances of obtaining loot from Mastogobs are increased by 75%.", "id": "57212", "quest": "2 Venerable Mastogob Wool"}, "2017-11-26": {"bonus": "An extra challenge is generated for fights against monsters in the Passage to Brakmar area.", "id": "15132", "quest": "2 Bad Boy Tattoo"}, "2017-11-27": {"bonus": "Experience gained in the Kimbo's Canopy dungeon is increased by 125%.", "id": "15024", "quest": "2 Moopet Stuffing"}, "2017-11-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Tears of Ouronigride area: one star will appear every 10 minutes.", "id": "51472", "quest": "2 Steam Crackler Heart"}, "2017-11-29": {"bonus": "The quantity of Cobalt harvested by miners is increased by 150%.", "id": "39077", "quest": "20 Cobalt"}, "2017-11-30": {"bonus": "The chances of obtaining loot in the Snowy Forest area are increased by 100%.", "id": "106628", "quest": "2 Buzta Ear"}, "2017-12-01": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Gobball Dungeon .", "id": "56016", "quest": "9 Gobball Leather"}, "2017-12-02": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Sufokia area.", "id": "84237", "quest": "1 Sand Dungeon Key"}, "2017-12-03": {"bonus": "Experience gained by fighting Pingwins is increased by 75%.", "id": "59049", "quest": "2 Pingwobble Skin"}, "2017-12-04": {"bonus": "The quantity of wood harvested by lumberjacks of all levels is increased by 100%.", "id": "38092", "quest": "20 Oak Wood"}, "2017-12-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Dreggon Tunnels area.", "id": "105206", "quest": "4 Black Dreggon Egg"}, "2017-12-06": {"bonus": "The quantity of tokens won from Kolossium fights is increased by 100%.", "id": "8005", "quest": "1 Scratchy Shovel"}, "2017-12-07": {"bonus": "The chances of obtaining loot from Koalaks are increased by 75%.", "id": "55720", "quest": "2 Dok Alako Fabric"}, "2017-12-08": {"bonus": "Experience gained in the Sakai Plain and Snowy Forest areas is increased by 100%.", "id": "109593", "quest": "2 Asploda Eye"}, "2017-12-09": {"bonus": "The quantity of Snowdrops harvested by alchemists is increased by 175%.", "id": "35635", "quest": "5 Snowdrop"}, "2017-12-10": {"bonus": "All varieties of Ivory Dragoturkey will give birth to one extra baby.", "id": "47419", "quest": "3 Dragoturkey Teeth"}, "2017-12-11": {"bonus": "Shoemakers save 10% of their ingredients when they craft items.", "id": "11004", "quest": "1 Tofu Sandals"}, "2017-12-12": {"bonus": "A special repeatable quest is available today near the Brakmar gate.", "id": "12145", "quest": "3 Brakmarian Intercity-Express Potion"}, "2017-12-13": {"bonus": "Ores of all types will reappear 100% more quickly than usual.", "id": "39108", "quest": "20 Copper"}, "2017-12-14": {"bonus": "Experience gained in the Canidae Dungeon is increased by 125%.", "id": "15463", "quest": "8 Ouginak Chops"}, "2017-12-15": {"bonus": "The chances of obtaining loot in the Lousy Pig Plain area are increased by 100%.", "id": "56429", "quest": "4 Lousy Pig Leather"}, "2017-12-16": {"bonus": "An extra challenge is generated for fights against Kwismas monsters .", "id": "154000", "quest": "2 Scarlet Kwismas Wrapping Paper"}, "2017-12-17": {"bonus": "The quantity of Kralove , Grey Sea Bream , Blue Ray , and Sickle-Hammerhead Shark harvested by fishermen is increased by 150%.", "id": "41309", "quest": "15 Kralove"}, "2017-12-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in all dungeons.", "id": "6007", "quest": "3 Twiggy Sword"}, "2017-12-19": {"bonus": "The chances of obtaining loot from Kwismas monsters are increased by 75%.", "id": "153007", "quest": "2 Snowflake"}, "2017-12-20": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Porco Territory area.", "id": "40660", "quest": "1 Aluminite"}, "2017-12-21": {"bonus": "Experience gained in the Heroes' Cemetery area is increased by 100%.", "id": "47432", "quest": "3 Pointed Tooth"}, "2017-12-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Pirate Boat and Castaway Island areas: one star will appear every 5 minutes.", "id": "15129", "quest": "2 Sailor Knot"}, "2017-12-23": {"bonus": "The quantity of Tender Meat harvested by Hunters is increased by 125%.", "id": "63483", "quest": "4 Tender Meat"}, "2017-12-24": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Kwismas monsters .", "id": "42164", "quest": "1 Gingerbread Sleigh"}, "2017-12-25": {"bonus": "Kwismas Gifts have been added to monster loot.", "id": "89002", "quest": "4 Kwismas Gift"}, "2017-12-26": {"bonus": "The chances of obtaining loot in the Royal Pingwin's Excavation dungeon are increased by 125%.", "id": "54674", "quest": "2 Shaman Pingwin Beard Hair"}, "2017-12-27": {"bonus": "Experience gained by fighting Kwismas monsters is increased by 75%.", "id": "42158", "quest": "1 Chocolate Gift Package"}, "2017-12-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Kwismas Haven , Land and Taiga areas: one star will appear every 15 minutes.", "id": "89002", "quest": "4 Kwismas Gift"}, "2017-12-29": {"bonus": "The quantity of Rye and Rice harvested by farmers is increased by 125%.", "id": "34082", "quest": "20 Rye"}, "2017-12-30": {"bonus": "The chances of obtaining loot in the Dark Jungle area are increased by 100%.", "id": "58001", "quest": "2 Dark Treeckler Seed"}, "2017-12-31": {"bonus": "Experience gains are increased by 50% for all craftsmen who can make consumables (Farmer, Hunter, Handyman, Fisherman, and Alchemist).", "id": "69744", "quest": "8 Lemon Papillote"}, "2018-01-01": {"bonus": "Archmonsters will appear 200% more quickly than usual.", "id": "105205", "quest": "4 Golden Dreggon Egg"}, "2018-01-02": {"bonus": "Farmers save 10% of their ingredients when they craft items.", "id": "34154", "quest": "20 Oats"}, "2018-01-03": {"bonus": "Experience gained by fighting Otomai's Ark monsters is increased by 75%.", "id": "15014", "quest": "2 Sparo's Scarf"}, "2018-01-04": {"bonus": "The chances of obtaining loot from Fangs of Glass monsters are increased by 75%.", "id": "65759", "quest": "2 Gluttonous Brockhard Tail"}, "2018-01-05": {"bonus": "The quantity of Yew Wood and Bamboo Wood harvested by lumberjacks is increased by 150%.", "id": "38094", "quest": "12 Yew Wood"}, "2018-01-06": {"bonus": "A special repeatable quest is available today near the Bakers' Workshop in Amakna Village .", "id": "54197", "quest": "2 Wo Wabbit Hair"}, "2018-01-07": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Forest animals .", "id": "15058", "quest": "7 Boar Snout"}, "2018-01-08": {"bonus": "Experience gained in the Sand Dungeon is increased by 125%.", "id": "55130", "quest": "2 Beach Towel"}, "2018-01-09": {"bonus": "The quality of items crafted in the city of Bonta is increased.", "id": "6001", "quest": "2 Holy Sword"}, "2018-01-10": {"bonus": "All varieties of Emerald Dragoturkey will give birth to one extra baby.", "id": "104594", "quest": "2 Golden Dragoturkey Wing"}, "2018-01-11": {"bonus": "The chances of obtaining loot in the Dopple Training area are increased by 100%.", "id": "15092", "quest": "2 Dopple Mirror"}, "2018-01-12": {"bonus": "The quantity of Silver harvested by miners is increased by 150%.", "id": "39028", "quest": "12 Silver"}, "2018-01-13": {"bonus": "Stars will appear on monster groups more quickly than usual in the Frozen Lake area: one star will appear every 15 minutes.", "id": "53646", "quest": "2 Pingwinkle Feather"}, "2018-01-14": {"bonus": "Experience gained in the Asparah Gorge area is increased by 100%.", "id": "47678", "quest": "2 Yomi Snowfoux Malleolus"}, "2018-01-15": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Putrid Peat Bog area.", "id": "15093", "quest": "2 Ouassingue Slobber"}, "2018-01-16": {"bonus": "The chances of obtaining loot from Ghosts are increased by 75%.", "id": "15094", "quest": "2 Family Relic"}, "2018-01-17": {"bonus": "An extra challenge is generated for fights against creatures in the Arachnee family.", "id": "103035", "quest": "7 Arachnee Leg"}, "2018-01-18": {"bonus": "The quantity of Pike , Eel , Perch , and Monkfish harvested by fishermen is increased by 150%.", "id": "41290", "quest": "14 Lard Bass"}, "2018-01-19": {"bonus": "Experience gained by fighting creatures in the Pandissident family is increased by 75%.", "id": "54002", "quest": "3 Pandora Hair"}, "2018-01-20": {"bonus": "The chances of obtaining loot in the Bonta Rat Dungeon are increased by 125%.", "id": "15095", "quest": "2 Jumpy Flea"}, "2018-01-21": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Edge of the Evil Forest area.", "id": "79177", "quest": "1 Bottle of Greedoburg"}, "2018-01-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dark Jungle area: one star will appear every 10 minutes.", "id": "36011", "quest": "2 Warguerite Bract"}, "2018-01-23": {"bonus": "The quantity of Ground Meat harvested by Hunters is increased by 125%.", "id": "175008", "quest": "5 Ground Meat"}, "2018-01-24": {"bonus": "The loot generated by Perceptors is increased by 300% in the Soft Oak Clearing .", "id": "108230", "quest": "2 Short-Tempered Dark Treechnid Bud"}, "2018-01-25": {"bonus": "Experience gained in the Primitive Cemetery area is increased by 100%.", "id": "47640", "quest": "2 Koalak Gravedigger Shinbone"}, "2018-01-26": {"bonus": "Smiths save 10% of their ingredients when they craft items.", "id": "7001", "quest": "3 Twiggy Hammer"}, "2018-01-27": {"bonus": "The quantity of Frosteez harvested by farmers is increased by 150%.", "id": "34552", "quest": "10 Frosteez"}, "2018-01-28": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Amakna Castle Rat Dungeon .", "id": "65521", "quest": "2 Ratter Tail"}, "2018-01-29": {"bonus": "The chances of obtaining loot in the Gobball Corner area are increased by 100%.", "id": "57056", "quest": "11 Gobball Wool"}, "2018-01-30": {"bonus": "An extra challenge is generated for fights against monsters in the Dark Jungle area.", "id": "36010", "quest": "2 Gwass Sepal"}, "2018-01-31": {"bonus": "The quantity of Wild Mint Leaves harvested by alchemists is increased by 125%.", "id": "36052", "quest": "15 Wild Mint"}, "2018-02-01": {"bonus": "Health Points are regenerated 300% more quickly than usual (outside of fights), and heals with consumables are 100% more effective than usual.", "id": "12038", "quest": "4 Superior Mini Healing Potion"}, "2018-02-02": {"bonus": "Experience gains and the chances of dropping loot are increased by 75% against all creatures considered to be in the Gobball family, including Mastogobs and Gobkools.", "id": "69825", "quest": "6 Meat Roulade"}, "2018-02-03": {"bonus": "For each item crafted, Fishermen have a 25% chance of creating a second one.", "id": "49083", "quest": "6 Sliced Gudgeon"}, "2018-02-04": {"bonus": "Experience gained in the Fangs of Glass area is increased by 100%.", "id": "47681", "quest": "2 Icy Brockhard Molar"}, "2018-02-05": {"bonus": "The chances of obtaining loot in the Bulb Cavern dungeon are increased by 125%.", "id": "59041", "quest": "4 Grass Snake Skin"}, "2018-02-06": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Scaraleaf Plain area.", "id": "9007", "quest": "8 Wisdom Ring"}, "2018-02-07": {"bonus": "Stars will appear on monster groups more quickly than usual in the Nolifis Island area: one star will appear every 5 minutes.", "id": "47006", "quest": "2 Pandulum Ghost Bone"}, "2018-02-08": {"bonus": "The quantity of Ash Wood harvested by lumberjacks is increased by 125%.", "id": "38017", "quest": "30 Ash Wood"}, "2018-02-09": {"bonus": "Experience gained by fighting Kanigers is increased by 150%.", "id": "47559", "quest": "4 Kaniger Nail"}, "2018-02-10": {"bonus": "All varieties of Ginger Dragoturkey will give birth to one extra baby.", "id": "47596", "quest": "5 Ginger Dragoturkey Peak"}, "2018-02-11": {"bonus": "The chances of obtaining loot in the Frozen Lake area are increased by 100%.", "id": "54675", "quest": "2 Mama Pingwin Down"}, "2018-02-12": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Boowolf family.", "id": "47106", "quest": "7 Boowolf Canine"}, "2018-02-13": {"bonus": "Trikortritt Surprises have been added to monster loot.", "id": "49081", "quest": "8 Grawn Fritters"}, "2018-02-14": {"bonus": "Anybody affected by the Chocrosis Curse will see experience gained by fighting monsters increase by 100%.", "id": "42004", "quest": "5 Passion Shigekax"}, "2018-02-15": {"bonus": "Experience gained in the Soft Oak Clearing is increased by 125%.", "id": "36015", "quest": "2 Healing Branch Leaf"}, "2018-02-16": {"bonus": "Hunters save 10% of their ingredients when they craft items.", "id": "175008", "quest": "3 Ground Meat"}, "2018-02-17": {"bonus": "The chances of obtaining loot from creatures in the Mushroom family are increased by 75%.", "id": "15001", "quest": "11 Mushroom"}, "2018-02-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Ancestral Domain .", "id": "108104", "quest": "5 Treechnid Bud"}, "2018-02-19": {"bonus": "The quantity of fish harvested by fishermen of all levels is increased by 100%.", "id": "41277", "quest": "25 Kittenfish"}, "2018-02-20": {"bonus": "An extra challenge is generated for fights against monsters in the Tree Keeholo Trunk area.", "id": "15022", "quest": "2 Air Pikoko Rump"}, "2018-02-21": {"bonus": "Experience gained in the Gisgoul, the Devastated Village area is increased by 100%.", "id": "37001", "quest": "8 Bwork Beer"}, "2018-02-22": {"bonus": "The chances of obtaining loot in the Dreggons' Sanctuary area are increased by 100%.", "id": "59609", "quest": "2 Dragostess Skin"}, "2018-02-23": {"bonus": "Resources will reappear 150% more quickly than usual in the Cania Fields area.", "id": "34154", "quest": "20 Oats"}, "2018-02-24": {"bonus": "Stars will appear on monster groups more quickly than usual in the Astrub Deep Tunnels area: one star will appear every 5 minutes.", "id": "47037", "quest": "4 Tofu Beak"}, "2018-02-25": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Nolifis Island area.", "id": "47003", "quest": "2 Leopardo Ghost Bone"}, "2018-02-26": {"bonus": "Experience gained by fighting creatures in the Mino family is increased by 75%.", "id": "59604", "quest": "3 Minoskito Skin"}, "2018-02-27": {"bonus": "The quantity of Bloody Meat harvested by Hunters is increased by 125%.", "id": "63453", "quest": "3 Bloody Meat"}, "2018-02-28": {"bonus": "The chances of obtaining loot from Moon Beach Monsters are increased by 75%.", "id": "46159", "quest": "2 Kokokonut"}, "2018-02-29": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Brakmar area.", "id": "4008", "quest": "1 Sacred Staff"}, "2018-03-01": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Brakmar area.", "id": "4008", "quest": "1 Sacred Staff"}, "2018-03-02": {"bonus": "Experience gained in the Agony V'Helley area is increased by 100%.", "id": "47031", "quest": "2 Adventurer Skull"}, "2018-03-03": {"bonus": "The quantity of Hornbeam Wood and Dark Bamboo Wood harvested by lumberjacks is increased by 150%.", "id": "38138", "quest": "3 Hornbeam Wood"}, "2018-03-04": {"bonus": "Stars will appear on monster groups more quickly than usual in the Petrified Forest area: one star will appear every 10 minutes.", "id": "119002", "quest": "2 Fistulina Volva"}, "2018-03-05": {"bonus": "An extra challenge is generated for fights against Moon pirates .", "id": "15088", "quest": "2 Hazwonarm Headband"}, "2018-03-06": {"bonus": "The chances of obtaining loot in the Frigost Village area are increased by 100%.", "id": "55731", "quest": "2 Stunted Rat Fabric"}, "2018-03-07": {"bonus": "Experience gained in the Pandikazes' Hideout dungeon is increased by 125%.", "id": "47664", "quest": "2 Giddy Pandikaze Claw"}, "2018-03-08": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Wabbit family.", "id": "103440", "quest": "7 Wabbit Paw"}, "2018-03-09": {"bonus": "The quantity of Hops harvested by farmers is increased by 125%.", "id": "34080", "quest": "20 Hop"}, "2018-03-10": {"bonus": "All varieties of Indigo Dragoturkey will give birth to one extra baby.", "id": "15424", "quest": "2 Dragoturkey Milk"}, "2018-03-11": {"bonus": "An extra challenge is generated for fights against monsters in the Bottomless Peat Bog area.", "id": "47698", "quest": "2 Miremop Tooth"}, "2018-03-12": {"bonus": "Fishermen save 10% of their ingredients when they craft items.", "id": "41269", "quest": "20 Breaded Fish"}, "2018-03-13": {"bonus": "Experience gained by fighting dungeon bosses is increased by 100%.", "id": "4003", "quest": "2 Staff Bonely"}, "2018-03-14": {"bonus": "The quantity of Five-Leaf Clovers harvested by alchemists is increased by 125%.", "id": "36067", "quest": "15 Five-Leaf Clover"}, "2018-03-15": {"bonus": "The chances of obtaining loot from Plains Boars are increased by 150%.", "id": "15540", "quest": "2 Plain Boar Snout"}, "2018-03-16": {"bonus": "Experience gained in the Zoth Village area is increased by 100%.", "id": "15099", "quest": "2 Zoth Girl's Toy"}, "2018-03-17": {"bonus": "Ayerish Kaffee is waiting near the Amakna Village Inn for adventurers who want to join him for a drink.", "id": "51145", "quest": "1 Emerald Stone"}, "2018-03-18": {"bonus": "Experience gained in the professions related to weapon and equipment crafting (Smiths, Carvers, Jewellers, Shoemakers, Tailors, and Artificers) is increased by 50%.", "id": "7012", "quest": "1 Birming Hammer"}, "2018-03-19": {"bonus": "The quantity of Manganese harvested by miners is increased by 150%.", "id": "39397", "quest": "15 Manganese"}, "2018-03-20": {"bonus": "The chances of obtaining loot in the Sakai Abandoned Mine dungeon are increased by 125%.", "id": "51466", "quest": "2 Drilla Stone"}, "2018-03-21": {"bonus": "Experience gained by fighting Gobballs is increased by 150%.", "id": "15057", "quest": "6 Gobball Slobber"}, "2018-03-22": {"bonus": "An extra challenge is generated for fights against Plain Cracklers .", "id": "51455", "quest": "3 Pointed Stone Fragment"}, "2018-03-23": {"bonus": "All types of wood will reappear 100% more quickly than usual.", "id": "38086", "quest": "20 Chestnut Wood"}, "2018-03-24": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Cania Fields area.", "id": "34082", "quest": "20 Barley"}, "2018-03-25": {"bonus": "The chances of obtaining loot in the Snowfoux Caverns area are increased by 100%.", "id": "57657", "quest": "2 Maho Snowfoux Wool"}, "2018-03-26": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Bearbarian Hive area.", "id": "106634", "quest": "2 Apewicubic Bearbarian Ear"}, "2018-03-27": {"bonus": "The quantity of Maggoty Meat harvested by Hunters is increased by 125%.", "id": "63420", "quest": "4 Maggoty Meat"}, "2018-03-28": {"bonus": "An extra challenge is generated for fights against Mastogobs .", "id": "47661", "quest": "2 Mastogob Warrior Horn"}, "2018-03-29": {"bonus": "Stars will appear on monster groups more quickly than usual in the Alma's Cradle area: one star will appear every 10 minutes.", "id": "55733", "quest": "2 Vigi Pirate Fabric"}, "2018-03-30": {"bonus": "The chances of obtaining loot from creatures in the Kitsou family are increased by 75%.", "id": "59046", "quest": "5 Kitsou Nae Skin"}, "2018-03-31": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Larva Dungeon .", "id": "47654", "quest": "2 Emerald Larva Tooth"}, "2018-04-01": {"bonus": "A special repeatable quest is available today near the Masqueraider Temple .", "id": "105648", "quest": "4 White Dreggon Egg"}, "2018-04-02": {"bonus": "The quantity of small river fish (Gudgeon, Trout, Kittenfish, Ediem Carp) and small sea fish (Grawn, Crab Surimi, Breaded Fish, Shiny Sardine) harvested by fishermen is increased by 125%.", "id": "41273", "quest": "16 Crab Surimi"}, "2018-04-03": {"bonus": "Experience gained in the Nolifis Island area is increased by 100%.", "id": "47002", "quest": "2 Yokai Firefoux Ghost Bone"}, "2018-04-04": {"bonus": "Artificers save 10% of their ingredients when they craft items.", "id": "82020", "quest": "2 Gobball Shield"}, "2018-04-05": {"bonus": "Experience gained in the Crackler Dungeon is increased by 125%.", "id": "47418", "quest": "1 Crackler's Gold Tooth"}, "2018-04-06": {"bonus": "The chances of obtaining loot in the Road to Brakmar area are increased by 100%.", "id": "54008", "quest": "7 Boowolf Hair"}, "2018-04-07": {"bonus": "The quantity of Barley harvested by farmers is increased by 125%.", "id": "34082", "quest": "20 Barley"}, "2018-04-08": {"bonus": "Experience gained by fighting Moon Beach Monsters is increased by 75%.", "id": "24018", "quest": "2 Green Carapace"}, "2018-04-09": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Inner Labyrinth of the Minotoror dungeon.", "id": "107735", "quest": "2 Scaratos Carapace"}, "2018-04-10": {"bonus": "All varieties of Crimson Dragoturkey will give birth to one extra baby.", "id": "93002", "quest": "1 Ash Manger"}, "2018-04-11": {"bonus": "Stars will appear on monster groups more quickly than usual in the Cania Lake area: one star will appear every 5 minutes.", "id": "15281", "quest": "9 Piece of Coco Blop"}, "2018-04-12": {"bonus": "The chances of obtaining loot from Pandala ghosts are increased by 75%.", "id": "47004", "quest": "2 Pandikaze Ghost Bone"}, "2018-04-13": {"bonus": "The quantity of Ebony Wood and Kaliptus Wood harvested by lumberjacks is increased by 150%.", "id": "38001", "quest": "8 Kaliptus Wood"}, "2018-04-14": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Zoth Village monsters .", "id": "4062", "quest": "2 Zoth Pipe"}, "2018-04-15": {"bonus": "For each item crafted, handymen have a 25% chance of creating a second one.", "id": "93005", "quest": "1 Ash Slapper"}, "2018-04-16": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Astrub area, as well as in the fields and in Astrub Forest .", "id": "49090", "quest": "2 Grilled Kralove"}, "2018-04-17": {"bonus": "The chances of obtaining loot in the Jelly Peninsula area are increased by 100%.", "id": "110040", "quest": "2 Strawberry Jelly"}, "2018-04-18": {"bonus": "An extra challenge is generated for fights against Bearbarians .", "id": "65762", "quest": "2 Mellifluous Bearbarian Tail"}, "2018-04-19": {"bonus": "The quantity of Gold harvested by miners is increased by 150%.", "id": "39022", "quest": "10 Gold"}, "2018-04-20": {"bonus": "Experience gained in the Border of Feudala area is increased by 100%.", "id": "54202", "quest": "3 Maho Firefoux Hair"}, "2018-04-21": {"bonus": "The chances of obtaining loot in the Inner Labyrinth of the Minotoror dungeon are increased by 125%.", "id": "47699", "quest": "2 Minokid Horn"}, "2018-04-22": {"bonus": "Resources will reappear 150% more quickly than usual in the Kawaii River and Madrestam Harbour areas.", "id": "41305", "quest": "10 Ediem Carp"}, "2018-04-23": {"bonus": "Experience gained by fighting Peat Bog monsters is increased by 75%.", "id": "15093", "quest": "2 Ouassingue Slobber"}, "2018-04-24": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Crackler Mountain area.", "id": "51127", "quest": "2 Crackler Stone"}, "2018-04-25": {"bonus": "The quantity of Stale Meat harvested by Hunters is increased by 125%.", "id": "63473", "quest": "3 Stale Meat"}, "2018-04-26": {"bonus": "Kamas gained are increased by 100% for all quests.", "id": "141010", "quest": "2 Suspicious Pouch"}, "2018-04-27": {"bonus": "Stars will appear on monster groups more quickly than usual in the Rocky Roads area: one star will appear every 15 minutes.", "id": "106562", "quest": "3 Foxfyter Ear"}, "2018-04-28": {"bonus": "Miners save 10% of their ingredients when they craft items.", "id": "50098", "quest": "1 Crystal"}, "2018-04-29": {"bonus": "The chances of obtaining loot from creatures in the Piwi family are increased by 75%.", "id": "53117", "quest": "4 Red Piwi Feather"}, "2018-04-30": {"bonus": "The quantity of plants harvested by alchemists of all levels is increased by 100%.", "id": "36643", "quest": "20 Sage"}, "2018-05-01": {"bonus": "For every Fairywork crafted, characters have a 25% chance of creating a second one, as well as a 10% change of keeping their ingredients.", "id": "15711", "quest": "2 Explosive Capsule"}, "2018-05-02": {"bonus": "Experienced gained in the Fungus Dungeon is increased by 125%.", "id": "15765", "quest": "1 Mushmunch Tongue"}, "2018-05-03": {"bonus": "The chances of obtaining loot from Tree Keeholo monsters are increased by 75%.", "id": "38003", "quest": "2 Light Treeckler Stump"}, "2018-05-04": {"bonus": "Bonuses gained by completing challenges are increased by 250% against Onis .", "id": "15662", "quest": "1 Oni Blood"}, "2018-05-05": {"bonus": "An extra challenge is generated for fights against monsters in the Grassy Plains area.", "id": "15015", "quest": "2 Mufafah Moustache"}, "2018-05-06": {"bonus": "The quantity of Bombu , Oliviolet and Maple harvested by lumberjacks is increased by 125%.", "id": "38153", "quest": "15 Maple Wood"}, "2018-05-07": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Frigost Village and Icefields areas.", "id": "69750", "quest": "5 Meatball"}, "2018-05-08": {"bonus": "A special repeatable quest is available today near Amakna Castle .", "id": "68135", "quest": "10 Potatoes"}, "2018-05-09": {"bonus": "The chances of obtaining loot in the Wild Canyon area are increased by 100%.", "id": "51496", "quest": "2 Medicinal Stone"}, "2018-05-10": {"bonus": "The resource protectors are 5 times more likely to appear during harvesting activities than usual.", "id": "81026", "quest": "1 Small Harvester Bag"}, "2018-05-11": {"bonus": "Experience gained in the Scaraleaf Plain area is increased by 100%.", "id": "107444", "quest": "1 Green Scaraleaf Carapace"}, "2018-05-12": {"bonus": "The quantity of Malt harvested by farmers is increased by 125%.", "id": "34083", "quest": "20 Malt"}, "2018-05-13": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Skeunk's Hideout dungeon.", "id": "15804", "quest": "1 Emeralda's Skeunk Autograph"}, "2018-05-14": {"bonus": "The quality of items crafted in the city of Astrub is increased.", "id": "5003", "quest": "2 Smithy Daggers"}, "2018-05-15": {"bonus": "Gobbowl Surprises have been added to monster loot.", "id": "57056", "quest": "11 Gobball Wool"}, "2018-05-16": {"bonus": "Plants harvested by alchemists will reappear 100% more quickly than usual.", "id": "36642", "quest": "40 Nettles"}, "2018-05-17": {"bonus": "The chances of obtaining loot from Mopy Kings are increased by 150%.", "id": "55019", "quest": "2 Mopy King Fabric"}, "2018-05-18": {"bonus": "Stars will appear on monster groups more quickly than usual in the Pandala Forest area: one star will appear every 5 minutes.", "id": "35119", "quest": "3 Bulbiflor Flower"}, "2018-05-19": {"bonus": "The quantity of Tin and Silicate harvested by miners is increased by 150%.", "id": "39078", "quest": "12 Tin"}, "2018-05-20": {"bonus": "Experience gained by fighting temple Dopples is increased by 75%.", "id": "15816", "quest": "2 Carbon Paper"}, "2018-05-21": {"bonus": "A special repeatable quest is available today to the east of the Lumberjacks' Workshop in Amakna Forest .", "id": "68031", "quest": "1 Cawwot"}, "2018-05-22": {"bonus": "An extra challenge is generated for fights against monsters in the Snowfoux Caverns area.", "id": "57658", "quest": "2 Yokai Snowfoux Wool"}, "2018-05-23": {"bonus": "The quantity of Perch , Monkfish , Lard Bass , and Tench harvested by fishermen is increased by 150%.", "id": "41313", "quest": "12 Perch"}, "2018-05-24": {"bonus": "The chances of obtaining loot in the Field Dungeon are increased by 125%.", "id": "58006", "quest": "3 Wild Sunflower Seed"}, "2018-05-25": {"bonus": "Experience gained in the Tree Keeholo Foliage area is increased by 100%.", "id": "15006", "quest": "2 Snailmet Slobber"}, "2018-05-26": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Amakna Castle Gobball Breeding Station area.", "id": "47055", "quest": "6 Gobball Horn"}, "2018-05-27": {"bonus": "For each item crafted, Farmers have a 25% chance of creating a second one.", "id": "33012", "quest": "10 Solid Bread"}, "2018-05-28": {"bonus": "The quantity of Blood-Soaked Meat harvested by hunters is increased by 125%.", "id": "63464", "quest": "2 Blood-Soaked Meat"}, "2018-05-29": {"bonus": "Stars will appear on monster groups more quickly than usual in the Kaliptus Forest area: one star will appear every 5 minutes.", "id": "54004", "quest": "2 Koalak Forester Hair"}, "2018-05-30": {"bonus": "Experience gained by fighting Dreggons is increased by 75%.", "id": "111202", "quest": "7 Golden Dreggon Shell"}, "2018-05-31": {"bonus": "The chances of obtaining loot in the Petrified Forest area are increased by 100%.", "id": "119001", "quest": "2 Dramanita Gill"}, "2018-06-01": {"bonus": "An extra challenge is generated for fights against creatures in the Beach monsters family.", "id": "47051", "quest": "5 Crab Pincer"}, "2018-06-02": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Madrestam Harbour area.", "id": "41317", "quest": "15 Shiny Sardine"}, "2018-06-03": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Blacksmith Dungeon .", "id": "58472", "quest": "2 Seed of Contention"}, "2018-06-04": {"bonus": "The loot generated by Perceptors is increased by 200% in all areas.", "id": "15131", "quest": "2 Counterfeit Royal Seal"}, "2018-06-05": {"bonus": "The quantity of ores harvested by miners of all levels is increased by 100%.", "id": "39022", "quest": "10 Gold"}, "2018-06-06": {"bonus": "The chances of obtaining loot from Count Harebourg , his four lieutenants and all their creatures are increased by 75%.", "id": "109602", "quest": "2 Harrogant Eye"}, "2018-06-07": {"bonus": "Experience gained by fighting Snowfoux is increased by 75%.", "id": "47685", "quest": "2 Kami Snowfoux Incisor"}, "2018-06-08": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Pandala Forest area.", "id": "36056", "quest": "2 Bulbamboo Shoot"}, "2018-06-09": {"bonus": "The quantity of Freyesque Orchids harvested by alchemists is increased by 150%.", "id": "35192", "quest": "10 Freyesque Orchid"}, "2018-06-10": {"bonus": "All varieties of Almond Dragoturkey will give birth to one extra baby.", "id": "47597", "quest": "5 Almond Dragoturkey Peak"}, "2018-06-11": {"bonus": "The chances of obtaining loot in the Turtle Beach area are increased by 100%.", "id": "15433", "quest": "2 Kokostraw"}, "2018-06-12": {"bonus": "The quality of items crafted in the city of Frigost Village is increased.", "id": "3002", "quest": "2 Ice Wand"}, "2018-06-13": {"bonus": "Experience gained in the Fungus Cavern area is increased by 100%.", "id": "15045", "quest": "1 Mush Rhume Slobber"}, "2018-06-14": {"bonus": "Handymen have a 10% chance of keeping their ingredients when they craft items.", "id": "84013", "quest": "1 Field Dungeon Key"}, "2018-06-15": {"bonus": "The quantity of Cherry Wood harvested by lumberjacks is increased by 125%.", "id": "38139", "quest": "12 Cherry Wood"}, "2018-06-16": {"bonus": "An extra challenge is generated for fights against monsters in the Dreggon Village area.", "id": "111211", "quest": "7 Sapphire Dreggon Shell"}, "2018-06-17": {"bonus": "The chances of obtaining loot from Bulbigs are increased by 150%.", "id": "98144", "quest": "2 Bulbig Root"}, "2018-06-18": {"bonus": "Experienced gained in the Dreggon Dungeon is increased by 125%.", "id": "59610", "quest": "2 Flying Dreggon Skin"}, "2018-06-19": {"bonus": "Bonuses gained by completing challenges are increased by 250% against Kitsou Nufeus .", "id": "59044", "quest": "5 Kitsou Nufeu Skin"}, "2018-06-20": {"bonus": "The quantity of Wheat harvested by farmers is increased by 125%.", "id": "34009", "quest": "40 Wheat"}, "2018-06-21": {"bonus": "The fees charged for using Zaaps , bank accounts and markets are all reduced by 50%.", "id": "15813", "quest": "2 Marine Conch"}, "2018-06-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Coral Beach area: one star will appear every 15 minutes.", "id": "47017", "quest": "2 Craboral Pincer"}, "2018-06-23": {"bonus": "The chances of obtaining loot in the Tree Keeholo Foliage area are increased by 100%.", "id": "15006", "quest": "2 Snailmet Slobber"}, "2018-06-24": {"bonus": "Experience gained by fighting Field Plants is increased by 75%.", "id": "36555", "quest": "4 Evil Dandelion Tongue"}, "2018-06-25": {"bonus": "Resources will reappear 150% more quickly than usual in the Sidimote Moors area.", "id": "39024", "quest": "40 Iron"}, "2018-06-26": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in Pandala Village and the surrounding area.", "id": "82004", "quest": "1 Lumberjack Shield"}, "2018-06-27": {"bonus": "The chances of obtaining loot in the Lair of the Giant Kralove dungeon are increased by 125%.", "id": "15817", "quest": "2 Old Kralove Sucker"}, "2018-06-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Arak-hai Forest area: one star will appear every 10 minutes.", "id": "98102", "quest": "7 Treechnid Root"}, "2018-06-29": {"bonus": "The quantity of Contaminated Meat harvested by Hunters is increased by 125%.", "id": "63491", "quest": "4 Contaminated Meat"}, "2018-06-30": {"bonus": "Experience gained in the Minotoror Island area is increased by 100%.", "id": "59602", "quest": "3 Manderisha Skin"}, "2018-07-01": {"bonus": "The chances of obtaining loot from Crocodyl Chiefs are increased by 150%.", "id": "59547", "quest": "4 Crocodyl Chief Scale"}, "2018-07-02": {"bonus": "An extra challenge is generated for fights against monsters in the Amakna Forest area.", "id": "47059", "quest": "6 Boar Tusk"}, "2018-07-03": {"bonus": "Alchemists have a 10% chance of keeping their ingredients when they craft items.", "id": "12016", "quest": "7 Mini Healing Potion"}, "2018-07-04": {"bonus": "The quality of items crafted in Amakna Village and Forest is increased.", "id": "33011", "quest": "2 Sesame Seed Bread"}, "2018-07-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Kitsoune Dungeon .", "id": "54559", "quest": "1 Kitsou Nakwa Hair"}, "2018-07-06": {"bonus": "The quantity of Kittenfish , Ediem Carp , Pike , and Eel harvested by fishermen is increased by 150%.", "id": "41277", "quest": "40 Kittenfish"}, "2018-07-07": {"bonus": "The chances of obtaining loot in the Tears of Ouronigride area are increased by 100%.", "id": "51471", "quest": "2 Solfatara Residue"}, "2018-07-08": {"bonus": "Experience gained by fighting Gobkools and Cave Gobballs is increased by 200%.", "id": "57001", "quest": "8 Gobkool Wool"}, "2018-07-09": {"bonus": "Experience gains are increased by 50% for all harvesting professions .", "id": "38017", "quest": "20 Ash Wood"}, "2018-07-10": {"bonus": "All varieties of Plum Dragoturkey will give birth to one extra baby.", "id": "2020", "quest": "1 Eco Bow"}, "2018-07-11": {"bonus": "The quantity of Bauxite harvested by miners is increased by 150%.", "id": "39076", "quest": "10 Bauxite"}, "2018-07-12": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Icefields area.", "id": "57211", "quest": "2 Mastogob Wool"}, "2018-07-13": {"bonus": "Experience gained in the Tears of Ouronigride area is increased by 100%.", "id": "51469", "quest": "2 Atomystique Stone"}, "2018-07-14": {"bonus": "Experience gained from Kolossium fights is increased by 100%.", "id": "15245", "quest": "2 Broken Chains"}, "2018-07-15": {"bonus": "The quantity of Marbled Meat harvested by Hunters is increased by 125%.", "id": "63457", "quest": "3 Marbled Meat"}, "2018-07-16": {"bonus": "The chances of obtaining loot from Vulkania monsters are increased by 75%.", "id": "15793", "quest": "2 Venerable Mud"}, "2018-07-17": {"bonus": "Stars will appear on monster groups more quickly than usual in the Astrub Meadow area: one star will appear every 10 minutes.", "id": "35018", "quest": "4 Evil Dandelion Flower"}, "2018-07-18": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Gobball Corner area.", "id": "26016", "quest": "5 Shrubstrate"}, "2018-07-19": {"bonus": "Experience gained in the Grotto Hesque is increased by 125%.", "id": "47012", "quest": "2 Coralator Coccyx"}, "2018-07-20": {"bonus": "Cereals harvested by farmers will reappear 100% more quickly than usual.", "id": "60061", "quest": "1 Wild Sunflower Oil"}, "2018-07-21": {"bonus": "The chances of obtaining loot in the Zoth Village area are increased by 100%.", "id": "50716", "quest": "2 Precious Zoth Stone"}, "2018-07-22": {"bonus": "An extra challenge is generated for fights against Frigost Village monsters .", "id": "53648", "quest": "2 Gullipop Feather"}, "2018-07-23": {"bonus": "Pet and petsmount bonuses are increased by 100%.", "id": "41292", "quest": "40 Grawn"}, "2018-07-24": {"bonus": "The quantity of Aspen , Holy Bamboo and Elm wood harvested by lumberjacks is increased by 200%.", "id": "38140", "quest": "1 Elm Wood"}, "2018-07-25": {"bonus": "Bonuses gained by completing challenges are increased by 150% against creatures in the Pig family.", "id": "59618", "quest": "1 Blodz Uker Skin"}, "2018-07-26": {"bonus": "Experience gained in the Lonesome Pine Trails area is increased by 100%.", "id": "65754", "quest": "2 Cromagmunk Tail"}, "2018-07-27": {"bonus": "Hunters have a 10% chance of keeping their ingredients when they craft items.", "id": "69115", "quest": "8 Astrubian Fritter"}, "2018-07-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Snowy Forest and Sakai Plain areas: one star will appear every 5 minutes.", "id": "47670", "quest": "2 Stabba Fibula"}, "2018-07-29": {"bonus": "The chances of obtaining loot in the Daggero's Lair dungeon are increased by 125%.", "id": "59045", "quest": "5 Kitsou Nere Skin"}, "2018-07-30": {"bonus": "Experience gains and the chances of dropping loot are increased by 125% in the Haunted House dungeon.", "id": "15089", "quest": "4 Vampire Blood"}, "2018-07-31": {"bonus": "Experience gained by fighting Vulkania monsters is increased by 75%.", "id": "48281", "quest": "2 Novice Powder"}, "2018-08-01": {"bonus": "The quantity of Edelweiss and Pandkin Seeds harvested by alchemists is increased by 175%.", "id": "35191", "quest": "10 Edelweiss"}, "2018-08-02": {"bonus": "The chances of obtaining loot from creatures in the Tofu family are increased by 75%.", "id": "105038", "quest": "5 Tofu Egg"}, "2018-08-03": {"bonus": "A special repeatable quest is available today just south of the Bonta gate.", "id": "12144", "quest": "3 Bontarian Intercity-Express Potion"}, "2018-08-04": {"bonus": "An extra challenge is generated for fights against Vulkania monsters .", "id": "48282", "quest": "2 Mature Ashes"}, "2018-08-05": {"bonus": "The quantity of Icefish harvested by fishermen is increased by 150%.", "id": "41403", "quest": "3 Icefish"}, "2018-08-06": {"bonus": "Experience gained in the Astrub Rocky Inlet area is increased by 100%.", "id": "15814", "quest": "2 Suntan Lotion"}, "2018-08-07": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Royal Rainbow Blop Lair dungeon.", "id": "98001", "quest": "2 Trunkiblop Root"}, "2018-08-08": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in Bonta .", "id": "11003", "quest": "4 Mulish Cat's Boots"}, "2018-08-09": {"bonus": "The quantity of cereals harvested by farmers of all levels is increased by 100%.", "id": "34009", "quest": "40 Wheat"}, "2018-08-10": {"bonus": "Fertile Dragoturkeys of all varieties will give birth to one extra baby.", "id": "47598", "quest": "2 Golden Dragoturkey Peak"}, "2018-08-11": {"bonus": "The chances of obtaining loot in the Nolifis Island area are increased by 100%.", "id": "47007", "quest": "2 Soryo Firefoux Ghost Bone"}, "2018-08-12": {"bonus": "Experience gained by fighting Moon Kanniballs is increased by 75%.", "id": "164077", "quest": "2 Kanniballs"}, "2018-08-13": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Vulkania monsters .", "id": "15794", "quest": "2 Juvenile Puddle"}, "2018-08-14": {"bonus": "Resources will reappear 150% more quickly than usual in the Amkana Forest area.", "id": "36052", "quest": "15 Wild Mint"}, "2018-08-15": {"bonus": "Stars will appear on monster groups more quickly than usual in all areas: one star will appear every 30 minutes.", "id": "15815", "quest": "2 Starfish Eyelid"}, "2018-08-16": {"bonus": "Experience gained in the Squirming Snapper area is increased by 100%.", "id": "15797", "quest": "2 Poacher's Armband"}, "2018-08-17": {"bonus": "The quantity of Bronze harvested by miners is increased by 150%.", "id": "39109", "quest": "20 Bronze"}, "2018-08-18": {"bonus": "The chances of obtaining loot from creatures in the Mino family are increased by 75%.", "id": "47699", "quest": "2 Minokid Horn"}, "2018-08-19": {"bonus": "Farmers have a 10% chance of keeping their ingredients when they craft items.", "id": "34080", "quest": "20 Hop"}, "2018-08-20": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Lousy Pig Plain area.", "id": "56141", "quest": "3 Piglet Leather"}, "2018-08-21": {"bonus": "Stars will appear on monster groups more quickly than usual in the Vulkanian Forest areas: one star will appear every 10 minutes.", "id": "15795", "quest": "2 Juvenile Smoke"}, "2018-08-22": {"bonus": "The quantity of Mineral Meat harvested by Hunters is increased by 125%.", "id": "63411", "quest": "4 Mineral Meat"}, "2018-08-23": {"bonus": "The chances of obtaining loot in the Mount Scauldron area are increased by 100%.", "id": "54682", "quest": "2 Torpid Bearbarian Hair"}, "2018-08-24": {"bonus": "Experience gained in the Bworker Dungeon is increased by 125%.", "id": "15819", "quest": "2 Mama Bwork Boil"}, "2018-08-25": {"bonus": "An extra challenge is generated for fights against monsters in the Ingalsses' Fields area.", "id": "35632", "quest": "3 Wild Sunflower Petal"}, "2018-08-26": {"bonus": "The loot generated by Perceptors is increased by 300% in the Dreggon Dungeon .", "id": "59609", "quest": "2 Dragostess Skin"}, "2018-08-27": {"bonus": "Experience gained by fighting Alma's Cradle monsters is increased by 75%.", "id": "59631", "quest": "2 Harpy Pirate Scale"}, "2018-08-28": {"bonus": "The quantity of Walnut Wood harvested by lumberjacks is increased by 150%.", "id": "38095", "quest": "20 Walnut Wood"}, "2018-08-29": {"bonus": "The chances of obtaining loot in the Blop Dungeon are increased by 125%.", "id": "35008", "quest": "2 Blopshroom Flower"}, "2018-08-30": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dragon Pig's Maze area: one star will appear every 5 minutes.", "id": "59617", "quest": "1 Dorgan Ation Skin"}, "2018-08-31": {"bonus": "Craftsmen have a 15% chance of keeping their ingredients when they craft items in the Amakna Forest area.", "id": "33011", "quest": "3 Sesame Seed Bread"}, "2018-09-01": {"bonus": "Experience gained in the Enchanted Lakes area is increased by 100%.", "id": "47010", "quest": "2 Fisheralak Bone"}, "2018-09-02": {"bonus": "Experience gains are increased by 50% for all professions.", "id": "12002", "quest": "4 Potion of Old Age"}, "2018-09-03": {"bonus": "The quantity of Nettles harvested by alchemists is increased by 125%.", "id": "36642", "quest": "40 Nettles"}, "2018-09-04": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Fangs of Glass monsters .", "id": "47680", "quest": "2 Bestial Brockhard Claw"}, "2018-09-05": {"bonus": "The chances of obtaining loot in the Neutral Pandala area are increased by 100%.", "id": "36069", "quest": "4 Bambooto Leaf"}, "2018-09-06": {"bonus": "Experience gained in Lord Crow's Library is increased by 125%.", "id": "54005", "quest": "1 Crowfox Hair"}, "2018-09-07": {"bonus": "An extra challenge is generated for fights against Tears of Ouronigride monsters .", "id": "51474", "quest": "2 Mofette Stone"}, "2018-09-08": {"bonus": "The quantity of Breaded Fish , Shiny Sardine , Kralove , and Grey Sea Bream harvested by fishermen is increased by 150%.", "id": "41317", "quest": "15 Shiny Sardine"}, "2018-09-09": {"bonus": "The chances of obtaining loot from Lousy Pig Shepherds are increased by 150%.", "id": "15512", "quest": "2 Broken Trident"}, "2018-09-10": {"bonus": "All varieties of Ebony Dragoturkey will give birth to one extra baby.", "id": "104593", "quest": "1 Almond Dragoturkey Wing"}, "2018-09-11": {"bonus": "Stars will appear on monster groups more quickly than usual in the Dreggons' Sanctuary area: one star will appear every 10 minutes.", "id": "59611", "quest": "2 Dreggon Warrior Skin"}, "2018-09-12": {"bonus": "The experience points awarded for completing alignment quests and city order quests are increased by 100%.", "id": "15247", "quest": "2 Spectral Flame"}, "2018-09-13": {"bonus": "The quantity of Flax harvested by farmers is increased by 125%.", "id": "34122", "quest": "20 Flax"}, "2018-09-14": {"bonus": "Experience gained by fighting Petrified Forest monsters is increased by 75%.", "id": "96668", "quest": "2 Treecherous Bark"}, "2018-09-15": {"bonus": "Jewellers save 10% of their ingredients when they craft items.", "id": "1011", "quest": "3 Rainbow Necklace"}, "2018-09-16": {"bonus": "The chances of obtaining loot in the Icefields area are increased by 100%.", "id": "106624", "quest": "2 Mastogobbly Ear"}, "2018-09-17": {"bonus": "Experience gained in Brouce Boulgoure's Clearing is increased by 100%.", "id": "15049", "quest": "7 Mush Mush Thorn"}, "2018-09-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Skeleton Dungeon .", "id": "47015", "quest": "4 Chafer Bone"}, "2018-09-19": {"bonus": "Experience gains and the chances of dropping loot are increased by 75% against all monsters considered to be pirates.", "id": "38095", "quest": "20 Walnut Wood"}, "2018-09-20": {"bonus": "The quantity of Fresh Meat picked up by hunters is increased by 125%.", "id": "63441", "quest": "3 Fresh Meat"}, "2018-09-21": {"bonus": "The quality of items crafted in the city of Brakmar is increased.", "id": "19013", "quest": "2 Vor'Om Axe"}, "2018-09-22": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Border of Feudala area.", "id": "54205", "quest": "3 Leopardo Hair"}, "2018-09-23": {"bonus": "The chances of obtaining loot from Grassy Plains monsters are increased by 75%.", "id": "54012", "quest": "2 Kilibriss Down"}, "2018-09-24": {"bonus": "Craftsmen save 15% of their ingredients when they craft items in the Countryside area.", "id": "19006", "quest": "4 Lumberjack Hatchet"}, "2018-09-25": {"bonus": "Experience gained by fighting Crocodyls is increased by 150%.", "id": "47234", "quest": "4 Crocodyl Teeth"}, "2018-09-26": {"bonus": "The quantity of Dolomite and Obsidian harvested by miners is increased by 175%.", "id": "39112", "quest": "21 Obsidian"}, "2018-09-27": {"bonus": "The chances of obtaining loot in the Firefoux Dungeon are increased by 125%.", "id": "54204", "quest": "4 Yokai Firefoux Hair"}, "2018-09-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Labyrinth of the Minotoror area: one star will appear every 5 minutes.", "id": "53004", "quest": "3 Quetsnakiatl Feather"}, "2018-09-29": {"bonus": "An extra challenge is generated for fights against monsters in the Otomai's Ark area.", "id": "15011", "quest": "2 Barbrossa's Shirt"}, "2018-09-30": {"bonus": "The loot generated by Perceptors is increased by 300% in the Kimbo's Canopy dungeon.", "id": "15022", "quest": "2 Air Pikoko Rump"}, "2018-10-01": {"bonus": "Experience gained by fighting Pandala ghosts is increased by 75%.", "id": "47008", "quest": "2 Maho Firefoux Ghost Bone"}, "2018-10-02": {"bonus": "The quantity of Oak Wood harvested by lumberjacks is increased by 150%.", "id": "38092", "quest": "20 Oak Wood"}, "2018-10-03": {"bonus": "A special repeatable quest is available today near the fountain in Amakna Village .", "id": "2001", "quest": "3 Twiggy Bow"}, "2018-10-04": {"bonus": "The chances of obtaining loot in the Milicluster area are increased by 100%.", "id": "47134", "quest": "3 Prespic Peak"}, "2018-10-05": {"bonus": "Fishermen save 10% of their ingredients when they craft items.", "id": "49074", "quest": "3 Crab Stick"}, "2018-10-06": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Tynril Lab dungeon.", "id": "36008", "quest": "2 Floramor Stamen"}, "2018-10-07": {"bonus": "Experience gained in the Dark Forest is increased by 100%.", "id": "98232", "quest": "1 Dark Treechnid Root"}, "2018-10-08": {"bonus": "Experience gained by mounts is increased by 200%.", "id": "69758", "quest": "3 Cottage Pie with Onion"}, "2018-10-09": {"bonus": "An extra challenge is generated for fights against Firefoux .", "id": "54203", "quest": "4 Soryo Firefoux Hair"}, "2018-10-10": {"bonus": "All varieties of Golden Dragoturkey will give birth to one extra baby.", "id": "41305", "quest": "10 Ediem Carp"}, "2018-10-11": {"bonus": "The chances of obtaining loot from Tears of Ouronigride monsters are increased by 75%.", "id": "51471", "quest": "2 Solfatara Residue"}, "2018-10-12": {"bonus": "All experience given as a reward for quests is increased by 100%.", "id": "38675", "quest": "3 Bambooto Wood"}, "2018-10-13": {"bonus": "Stars will appear on monster groups more quickly than usual in the Neutral Pandala area: one star will appear every 10 minutes.", "id": "103716", "quest": "4 Araknawa Leg"}, "2018-10-14": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Evil Forest area.", "id": "104048", "quest": "7 Evil Tofu Wing"}, "2018-10-15": {"bonus": "The quantity of Sage harvested by alchemists is increased by 125%.", "id": "36643", "quest": "20 Sage"}, "2018-10-16": {"bonus": "The chances of obtaining loot in the the Koolich Cavern dungeon are increased by 125%.", "id": "47009", "quest": "9 Gobkool Horn"}, "2018-10-17": {"bonus": "Harvesters save 15% of their ingredients when they craft items in the Lonesome Pine Trails area.", "id": "63348", "quest": "3 Rotten Meat"}, "2018-10-18": {"bonus": "Experience gained by fighting Zoths is increased by 75%.", "id": "15130", "quest": "2 Zoth Smoke Machine"}, "2018-10-19": {"bonus": "Fish of all types will reappear 100% more quickly than usual.", "id": "41400", "quest": "15 Pike"}, "2018-10-20": {"bonus": "The chances of obtaining loot on the Dreggon Peninsula are increased by 100%.", "id": "111203", "quest": "7 Black Dreggon Shell"}, "2018-10-21": {"bonus": "", "id": "69804", "quest": "4 Countrywoman Pan Fry"}, "2018-10-22": {"bonus": "Experience gained in the Cradle area is increased by 100%.", "id": "53014", "quest": "7 Tofu Feather"}, "2018-10-23": {"bonus": "Stars will appear on monster groups more quickly than usual in the Sidimote Moors area: one star will appear every 15 minutes.", "id": "53327", "quest": "4 Crobak Feather"}, "2018-10-24": {"bonus": "The quantity of Iron harvested by miners is increased by 150%.", "id": "39024", "quest": "40 Iron"}, "2018-10-25": {"bonus": "The chances of obtaining loot from Lonesome Pine Trail monsters are increased by 75%.", "id": "54676", "quest": "2 Sabredon Hair"}, "2018-10-26": {"bonus": "Experience gained in the Wa Wabbit's Castle is increased by 125%.", "id": "47758", "quest": "5 Wabbit Teeth"}, "2018-10-27": {"bonus": "Carvers save 10% of their ingredients when they craft items.", "id": "3008", "quest": "3 Twiggy Wand"}, "2018-10-28": {"bonus": "The quantity of Hemp harvested by farmers is increased by 125%.", "id": "34121", "quest": "20 Hemp"}, "2018-10-29": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Snowfoux .", "id": "106629", "quest": "2 Soryo Snowfoux Ear"}, "2018-10-30": {"bonus": "An extra challenge is generated for fights against monsters in the Snowy Forest area.", "id": "59630", "quest": "2 Grabba Skin"}, "2018-10-31": {"bonus": "Trikortritt Surprises have been added to monster loot.", "id": "54131", "quest": "4 Bwork Magus Beard Hair"}, "2018-11-01": {"bonus": "Experience gained by fighting monsters and the chances of dropping loot are increased by 50% for all adventurers wearing a pair of pants, briefs or similar.", "id": "56649", "quest": "2 Bwork Archer Briefs"}, "2018-11-02": {"bonus": "The chances of obtaining loot in the Brumen Tinctorias's Laboratory dungeon are increased by 125%.", "id": "15451", "quest": "9 Kolerat Whiskers"}, "2018-11-03": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Amakna Village area.", "id": "17194", "quest": "1 Dark Cloak"}, "2018-11-04": {"bonus": "Experience gained by fighting Bandits and Dark Craftsmen is increased by 75%.", "id": "15131", "quest": "2 Counterfeit Royal Seal"}, "2018-11-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Permafrost Port area.", "id": "54677", "quest": "2 Woolly Bow Meow Hair"}, "2018-11-06": {"bonus": "The quantity of Chestnut Wood harvested by lumberjacks is increased by 125%.", "id": "38086", "quest": "20 Chestnut Wood"}, "2018-11-07": {"bonus": "Experience gained in the Dark Jungle area is increased by 100%.", "id": "36012", "quest": "2 Barkritter Calyx"}, "2018-11-08": {"bonus": "An extra challenge is generated for fights against monsters in the Edge of the Evil Forest area.", "id": "65579", "quest": "2 Prespic Tail"}, "2018-11-09": {"bonus": "The chances of obtaining loot in the Alma's Cradle area are increased by 100%.", "id": "111751", "quest": "2 Yuara Pirate Shell"}, "2018-11-10": {"bonus": "All varieties of Orchid Dragoturkey will give birth to one extra baby.", "id": "41294", "quest": "28 Gudgeon"}, "2018-11-11": {"bonus": "Our Miss Triste is waiting by the fountain in Amakna Village to give adventurers ugly-overs.", "id": "59233", "quest": "4 Crocodyl Scale"}, "2018-11-12": {"bonus": "The quantity of Blue Ray , Sickle-Hammerhead Shark , Cod , and Swordfish harvested by fishermen is increased by 150%.", "id": "41296", "quest": "18 Blue Ray"}, "2018-11-13": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Brakmar Rat Dungeon .", "id": "15133", "quest": "2 Poisonous Slobber"}, "2018-11-14": {"bonus": "The chances of obtaining loot from hostile Dragoturkeys are increased by 75%.", "id": "104592", "quest": "1 Ginger Dragoturkey Wing"}, "2018-11-15": {"bonus": "A special repeatable quest is available today near the statue of the god Sram in Astrub .", "id": "5009", "quest": "2 Leurnettes"}, "2018-11-16": {"bonus": "Experience gained by fighting Sewer monsters is increased by 75%.", "id": "59622", "quest": "2 Grossewer Shaman Skin"}, "2018-11-17": {"bonus": "The quantity of lvl.", "id": "63476", "quest": "1 Macerated Meat"}, "2018-11-18": {"bonus": "An extra challenge is generated for fights against Sewer monsters .", "id": "103034", "quest": "2 Sewer Keeper Leg"}, "2018-11-19": {"bonus": "Lumberjacks save 10% of their ingredients when they craft items.", "id": "26017", "quest": "3 Timber Substrate"}, "2018-11-20": {"bonus": "Stars will appear on monster groups more quickly than usual in the Brakmar City Walls area: one star will appear every 10 minutes.", "id": "103330", "quest": "5 Crobak Foot"}, "2018-11-21": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Tree Keeholo monsters .", "id": "15021", "quest": "2 Cheeken Cloaca"}, "2018-11-22": {"bonus": "Bonuses awarded by mounts are increased by 100%.", "id": "63426", "quest": "4 Rancid Meat"}, "2018-11-23": {"bonus": "Experience gained in the Cemetery of the Tortured area is increased by 100%.", "id": "47697", "quest": "2 Draugur Chafer Jaw"}, "2018-11-24": {"bonus": "The quantity of Oats harvested by farmers is increased by 125%.", "id": "34154", "quest": "20 Oats"}, "2018-11-25": {"bonus": "The chances of obtaining loot from Mastogobs are increased by 75%.", "id": "57212", "quest": "2 Venerable Mastogob Wool"}, "2018-11-26": {"bonus": "An extra challenge is generated for fights against monsters in the Passage to Brakmar area.", "id": "15132", "quest": "2 Bad Boy Tattoo"}, "2018-11-27": {"bonus": "Experience gained in the Kimbo's Canopy dungeon is increased by 125%.", "id": "15024", "quest": "2 Moopet Stuffing"}, "2018-11-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Tears of Ouronigride area: one star will appear every 10 minutes.", "id": "51472", "quest": "2 Steam Crackler Heart"}, "2018-11-29": {"bonus": "The quantity of Cobalt harvested by miners is increased by 150%.", "id": "39077", "quest": "20 Cobalt"}, "2018-11-30": {"bonus": "The chances of obtaining loot in the Snowy Forest area are increased by 100%.", "id": "106628", "quest": "2 Buzta Ear"}, "2018-12-01": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Gobball Dungeon .", "id": "56016", "quest": "9 Gobball Leather"}, "2018-12-02": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Sufokia area.", "id": "84237", "quest": "1 Sand Dungeon Key"}, "2018-12-03": {"bonus": "Experience gained by fighting Pingwins is increased by 75%.", "id": "59049", "quest": "2 Pingwobble Skin"}, "2018-12-04": {"bonus": "The quantity of wood harvested by lumberjacks of all levels is increased by 100%.", "id": "38092", "quest": "20 Oak Wood"}, "2018-12-05": {"bonus": "Bonuses gained by completing challenges are increased by 200% in the Dreggon Tunnels area.", "id": "105206", "quest": "4 Black Dreggon Egg"}, "2018-12-06": {"bonus": "The quantity of tokens won from Kolossium fights is increased by 100%.", "id": "8005", "quest": "1 Scratchy Shovel"}, "2018-12-07": {"bonus": "The chances of obtaining loot from Koalaks are increased by 75%.", "id": "55720", "quest": "2 Dok Alako Fabric"}, "2018-12-08": {"bonus": "Experience gained in the Sakai Plain and Snowy Forest areas is increased by 100%.", "id": "109593", "quest": "2 Asploda Eye"}, "2018-12-09": {"bonus": "The quantity of Snowdrops harvested by alchemists is increased by 175%.", "id": "35635", "quest": "5 Snowdrop"}, "2018-12-10": {"bonus": "All varieties of Ivory Dragoturkey will give birth to one extra baby.", "id": "47419", "quest": "3 Dragoturkey Teeth"}, "2018-12-11": {"bonus": "Shoemakers save 10% of their ingredients when they craft items.", "id": "11004", "quest": "1 Tofu Sandals"}, "2018-12-12": {"bonus": "A special repeatable quest is available today near the Brakmar gate.", "id": "12145", "quest": "3 Brakmarian Intercity-Express Potion"}, "2018-12-13": {"bonus": "Ores of all types will reappear 100% more quickly than usual.", "id": "39108", "quest": "20 Copper"}, "2018-12-14": {"bonus": "Experience gained in the Canidae Dungeon is increased by 125%.", "id": "15463", "quest": "8 Ouginak Chops"}, "2018-12-15": {"bonus": "The chances of obtaining loot in the Lousy Pig Plain area are increased by 100%.", "id": "56429", "quest": "4 Lousy Pig Leather"}, "2018-12-16": {"bonus": "An extra challenge is generated for fights against Kwismas monsters .", "id": "154000", "quest": "2 Scarlet Kwismas Wrapping Paper"}, "2018-12-17": {"bonus": "The quantity of Kralove , Grey Sea Bream , Blue Ray , and Sickle-Hammerhead Shark harvested by fishermen is increased by 150%.", "id": "41309", "quest": "15 Kralove"}, "2018-12-18": {"bonus": "Bonuses gained by completing challenges are increased by 200% in all dungeons.", "id": "6007", "quest": "3 Twiggy Sword"}, "2018-12-19": {"bonus": "The chances of obtaining loot from Kwismas monsters are increased by 75%.", "id": "153007", "quest": "2 Snowflake"}, "2018-12-20": {"bonus": "Harvesters and craftsmen save 15% of their ingredients when they craft items in the Porco Territory area.", "id": "40660", "quest": "1 Aluminite"}, "2018-12-21": {"bonus": "Experience gained in the Heroes' Cemetery area is increased by 100%.", "id": "47432", "quest": "3 Pointed Tooth"}, "2018-12-22": {"bonus": "Stars will appear on monster groups more quickly than usual in the Pirate Boat and Castaway Island areas: one star will appear every 5 minutes.", "id": "15129", "quest": "2 Sailor Knot"}, "2018-12-23": {"bonus": "The quantity of Tender Meat harvested by Hunters is increased by 125%.", "id": "63483", "quest": "4 Tender Meat"}, "2018-12-24": {"bonus": "Bonuses gained by completing challenges are increased by 150% against Kwismas monsters .", "id": "42164", "quest": "1 Gingerbread Sleigh"}, "2018-12-25": {"bonus": "Kwismas Gifts have been added to monster loot.", "id": "89002", "quest": "4 Kwismas Gift"}, "2018-12-26": {"bonus": "The chances of obtaining loot in the Royal Pingwin's Excavation dungeon are increased by 125%.", "id": "54674", "quest": "2 Shaman Pingwin Beard Hair"}, "2018-12-27": {"bonus": "Experience gained by fighting Kwismas monsters is increased by 75%.", "id": "42158", "quest": "1 Chocolate Gift Package"}, "2018-12-28": {"bonus": "Stars will appear on monster groups more quickly than usual in the Kwismas Haven , Land and Taiga areas: one star will appear every 15 minutes.", "id": "89002", "quest": "4 Kwismas Gift"}, "2018-12-29": {"bonus": "The quantity of Rye and Rice harvested by farmers is increased by 125%.", "id": "34082", "quest": "20 Rye"}, "2018-12-30": {"bonus": "The chances of obtaining loot in the Dark Jungle area are increased by 100%.", "id": "58001", "quest": "2 Dark Treeckler Seed"}, "2018-12-31": {"bonus": "Experience gains are increased by 50% for all craftsmen who can make consumables (Farmer, Hunter, Handyman, Fisherman, and Alchemist).", "id": "69744", "quest": "8 Lemon Papillote"}}